GopalSaraf/Practicals/PSDL/include/proc/pic16lf1615.inc
// Register: CWG1CLKCON
#define CWG1CLKCON CWG1CLKCON
CWG1CLKCON                               equ 0699h
// bitfield definitions
CWG1CLKCON_CS_POSN                       equ 0000h
CWG1CLKCON_CS_POSITION                   equ 0000h
CWG1CLKCON_CS_SIZE                       equ 0001h
CWG1CLKCON_CS_LENGTH                     equ 0001h
CWG1CLKCON_CS_MASK                       equ 0001h
CWG1CLKCON_CWG1CS_POSN                   equ 0000h
CWG1CLKCON_CWG1CS_POSITION               equ 0000h
CWG1CLKCON_CWG1CS_SIZE                   equ 0001h
CWG1CLKCON_CWG1CS_LENGTH                 equ 0001h
CWG1CLKCON_CWG1CS_MASK                   equ 0001h

// Register: CWG1ISM
#define CWG1ISM CWG1ISM
CWG1ISM                                  equ 069Ah
// bitfield definitions
CWG1ISM_IS_POSN                          equ 0000h
CWG1ISM_IS_POSITION                      equ 0000h
CWG1ISM_IS_SIZE                          equ 0008h
CWG1ISM_IS_LENGTH                        equ 0008h
CWG1ISM_IS_MASK                          equ 00FFh
CWG1ISM_IS0_POSN                         equ 0000h
CWG1ISM_IS0_POSITION                     equ 0000h
CWG1ISM_IS0_SIZE                         equ 0001h
CWG1ISM_IS0_LENGTH                       equ 0001h
CWG1ISM_IS0_MASK                         equ 0001h
CWG1ISM_IS1_POSN                         equ 0001h
CWG1ISM_IS1_POSITION                     equ 0001h
CWG1ISM_IS1_SIZE                         equ 0001h
CWG1ISM_IS1_LENGTH                       equ 0001h
CWG1ISM_IS1_MASK                         equ 0002h
CWG1ISM_IS2_POSN                         equ 0002h
CWG1ISM_IS2_POSITION                     equ 0002h
CWG1ISM_IS2_SIZE                         equ 0001h
CWG1ISM_IS2_LENGTH                       equ 0001h
CWG1ISM_IS2_MASK                         equ 0004h
CWG1ISM_IS3_POSN                         equ 0003h
CWG1ISM_IS3_POSITION                     equ 0003h
CWG1ISM_IS3_SIZE                         equ 0001h
CWG1ISM_IS3_LENGTH                       equ 0001h
CWG1ISM_IS3_MASK                         equ 0008h
CWG1ISM_CWG1IS_POSN                      equ 0000h
CWG1ISM_CWG1IS_POSITION                  equ 0000h
CWG1ISM_CWG1IS_SIZE                      equ 0008h
CWG1ISM_CWG1IS_LENGTH                    equ 0008h
CWG1ISM_CWG1IS_MASK                      equ 00FFh
CWG1ISM_CWG1IS0_POSN                     equ 0000h
CWG1ISM_CWG1IS0_POSITION                 equ 0000h
CWG1ISM_CWG1IS0_SIZE                     equ 0001h
CWG1ISM_CWG1IS0_LENGTH                   equ 0001h
CWG1ISM_CWG1IS0_MASK                     equ 0001h
CWG1ISM_CWG1IS1_POSN                     equ 0001h
CWG1ISM_CWG1IS1_POSITION                 equ 0001h
CWG1ISM_CWG1IS1_SIZE                     equ 0001h
CWG1ISM_CWG1IS1_LENGTH                   equ 0001h
CWG1ISM_CWG1IS1_MASK                     equ 0002h
CWG1ISM_CWG1IS2_POSN                     equ 0002h
CWG1ISM_CWG1IS2_POSITION                 equ 0002h
CWG1ISM_CWG1IS2_SIZE                     equ 0001h
CWG1ISM_CWG1IS2_LENGTH                   equ 0001h
CWG1ISM_CWG1IS2_MASK                     equ 0004h
CWG1ISM_CWG1IS3_POSN                     equ 0003h
CWG1ISM_CWG1IS3_POSITION                 equ 0003h
CWG1ISM_CWG1IS3_SIZE                     equ 0001h
CWG1ISM_CWG1IS3_LENGTH                   equ 0001h
CWG1ISM_CWG1IS3_MASK                     equ 0008h

// Register: WDTCON0
#define WDTCON0 WDTCON0
WDTCON0                                  equ 0711h
// bitfield definitions
WDTCON0_SEN_POSN                         equ 0000h
WDTCON0_SEN_POSITION                     equ 0000h
WDTCON0_SEN_SIZE                         equ 0001h
WDTCON0_SEN_LENGTH                       equ 0001h
WDTCON0_SEN_MASK                         equ 0001h
WDTCON0_WDTPS_POSN                       equ 0001h
WDTCON0_WDTPS_POSITION                   equ 0001h
WDTCON0_WDTPS_SIZE                       equ 0005h
WDTCON0_WDTPS_LENGTH                     equ 0005h
WDTCON0_WDTPS_MASK                       equ 003Eh
WDTCON0_SWDTEN_POSN                      equ 0000h
WDTCON0_SWDTEN_POSITION                  equ 0000h
WDTCON0_SWDTEN_SIZE                      equ 0001h
WDTCON0_SWDTEN_LENGTH                    equ 0001h
WDTCON0_SWDTEN_MASK                      equ 0001h
WDTCON0_WDTSEN_POSN                      equ 0000h
WDTCON0_WDTSEN_POSITION                  equ 0000h
WDTCON0_WDTSEN_SIZE                      equ 0001h
WDTCON0_WDTSEN_LENGTH                    equ 0001h
WDTCON0_WDTSEN_MASK                      equ 0001h
WDTCON0_WDTPS0_POSN                      equ 0001h
WDTCON0_WDTPS0_POSITION                  equ 0001h
WDTCON0_WDTPS0_SIZE                      equ 0001h
WDTCON0_WDTPS0_LENGTH                    equ 0001h
WDTCON0_WDTPS0_MASK                      equ 0002h
WDTCON0_WDTPS1_POSN                      equ 0002h
WDTCON0_WDTPS1_POSITION                  equ 0002h
WDTCON0_WDTPS1_SIZE                      equ 0001h
WDTCON0_WDTPS1_LENGTH                    equ 0001h
WDTCON0_WDTPS1_MASK                      equ 0004h
WDTCON0_WDTPS2_POSN                      equ 0003h
WDTCON0_WDTPS2_POSITION                  equ 0003h
WDTCON0_WDTPS2_SIZE                      equ 0001h
WDTCON0_WDTPS2_LENGTH                    equ 0001h
WDTCON0_WDTPS2_MASK                      equ 0008h
WDTCON0_WDTPS3_POSN                      equ 0004h
WDTCON0_WDTPS3_POSITION                  equ 0004h
WDTCON0_WDTPS3_SIZE                      equ 0001h
WDTCON0_WDTPS3_LENGTH                    equ 0001h
WDTCON0_WDTPS3_MASK                      equ 0010h
WDTCON0_WDTPS4_POSN                      equ 0005h
WDTCON0_WDTPS4_POSITION                  equ 0005h
WDTCON0_WDTPS4_SIZE                      equ 0001h
WDTCON0_WDTPS4_LENGTH                    equ 0001h
WDTCON0_WDTPS4_MASK                      equ 0020h

// Register: WDTCON1
#define WDTCON1 WDTCON1
WDTCON1                                  equ 0712h
// bitfield definitions
WDTCON1_WINDOW_POSN                      equ 0000h
WDTCON1_WINDOW_POSITION                  equ 0000h
WDTCON1_WINDOW_SIZE                      equ 0003h
WDTCON1_WINDOW_LENGTH                    equ 0003h
WDTCON1_WINDOW_MASK                      equ 0007h
WDTCON1_WDTCS_POSN                       equ 0004h
WDTCON1_WDTCS_POSITION                   equ 0004h
WDTCON1_WDTCS_SIZE                       equ 0003h
WDTCON1_WDTCS_LENGTH                     equ 0003h
WDTCON1_WDTCS_MASK                       equ 0070h
WDTCON1_WINDOW0_POSN                     equ 0000h
WDTCON1_WINDOW0_POSITION                 equ 0000h
WDTCON1_WINDOW0_SIZE                     equ 0001h
WDTCON1_WINDOW0_LENGTH                   equ 0001h
WDTCON1_WINDOW0_MASK                     equ 0001h
WDTCON1_WINDOW1_POSN                     equ 0001h
WDTCON1_WINDOW1_POSITION                 equ 0001h
WDTCON1_WINDOW1_SIZE                     equ 0001h
WDTCON1_WINDOW1_LENGTH                   equ 0001h
WDTCON1_WINDOW1_MASK                     equ 0002h
WDTCON1_WINDOW2_POSN                     equ 0002h
WDTCON1_WINDOW2_POSITION                 equ 0002h
WDTCON1_WINDOW2_SIZE                     equ 0001h
WDTCON1_WINDOW2_LENGTH                   equ 0001h
WDTCON1_WINDOW2_MASK                     equ 0004h
WDTCON1_WDTWINDOW_POSN                   equ 0000h
WDTCON1_WDTWINDOW_POSITION               equ 0000h
WDTCON1_WDTWINDOW_SIZE                   equ 0003h
WDTCON1_WDTWINDOW_LENGTH                 equ 0003h
WDTCON1_WDTWINDOW_MASK                   equ 0007h
WDTCON1_WDTWINDOW0_POSN                  equ 0000h
WDTCON1_WDTWINDOW0_POSITION              equ 0000h
WDTCON1_WDTWINDOW0_SIZE                  equ 0001h
WDTCON1_WDTWINDOW0_LENGTH                equ 0001h
WDTCON1_WDTWINDOW0_MASK                  equ 0001h
WDTCON1_WDTWINDOW1_POSN                  equ 0001h
WDTCON1_WDTWINDOW1_POSITION              equ 0001h
WDTCON1_WDTWINDOW1_SIZE                  equ 0001h
WDTCON1_WDTWINDOW1_LENGTH                equ 0001h
WDTCON1_WDTWINDOW1_MASK                  equ 0002h
WDTCON1_WDTWINDOW2_POSN                  equ 0002h
WDTCON1_WDTWINDOW2_POSITION              equ 0002h
WDTCON1_WDTWINDOW2_SIZE                  equ 0001h
WDTCON1_WDTWINDOW2_LENGTH                equ 0001h
WDTCON1_WDTWINDOW2_MASK                  equ 0004h
WDTCON1_WDTCS0_POSN                      equ 0004h
WDTCON1_WDTCS0_POSITION                  equ 0004h
WDTCON1_WDTCS0_SIZE                      equ 0001h
WDTCON1_WDTCS0_LENGTH                    equ 0001h
WDTCON1_WDTCS0_MASK                      equ 0010h
WDTCON1_WDTCS1_POSN                      equ 0005h
WDTCON1_WDTCS1_POSITION                  equ 0005h
WDTCON1_WDTCS1_SIZE                      equ 0001h
WDTCON1_WDTCS1_LENGTH                    equ 0001h
WDTCON1_WDTCS1_MASK                      equ 0020h
WDTCON1_WDTCS2_POSN                      equ 0006h
WDTCON1_WDTCS2_POSITION                  equ 0006h
WDTCON1_WDTCS2_SIZE                      equ 0001h
WDTCON1_WDTCS2_LENGTH                    equ 0001h
WDTCON1_WDTCS2_MASK                      equ 0040h

// Register: WDTPSL
#define WDTPSL WDTPSL
WDTPSL                                   equ 0713h
// bitfield definitions
WDTPSL_PSCNT_POSN                        equ 0000h
WDTPSL_PSCNT_POSITION                    equ 0000h
WDTPSL_PSCNT_SIZE                        equ 0008h
WDTPSL_PSCNT_LENGTH                      equ 0008h
WDTPSL_PSCNT_MASK                        equ 00FFh
WDTPSL_PSCNT0_POSN                       equ 0000h
WDTPSL_PSCNT0_POSITION                   equ 0000h
WDTPSL_PSCNT0_SIZE                       equ 0001h
WDTPSL_PSCNT0_LENGTH                     equ 0001h
WDTPSL_PSCNT0_MASK                       equ 0001h
WDTPSL_PSCNT1_POSN                       equ 0001h
WDTPSL_PSCNT1_POSITION                   equ 0001h
WDTPSL_PSCNT1_SIZE                       equ 0001h
WDTPSL_PSCNT1_LENGTH                     equ 0001h
WDTPSL_PSCNT1_MASK                       equ 0002h
WDTPSL_PSCNT2_POSN                       equ 0002h
WDTPSL_PSCNT2_POSITION                   equ 0002h
WDTPSL_PSCNT2_SIZE                       equ 0001h
WDTPSL_PSCNT2_LENGTH                     equ 0001h
WDTPSL_PSCNT2_MASK                       equ 0004h
WDTPSL_PSCNT3_POSN                       equ 0003h
WDTPSL_PSCNT3_POSITION                   equ 0003h
WDTPSL_PSCNT3_SIZE                       equ 0001h
WDTPSL_PSCNT3_LENGTH                     equ 0001h
WDTPSL_PSCNT3_MASK                       equ 0008h
WDTPSL_PSCNT4_POSN                       equ 0004h
WDTPSL_PSCNT4_POSITION                   equ 0004h
WDTPSL_PSCNT4_SIZE                       equ 0001h
WDTPSL_PSCNT4_LENGTH                     equ 0001h
WDTPSL_PSCNT4_MASK                       equ 0010h
WDTPSL_PSCNT5_POSN                       equ 0005h
WDTPSL_PSCNT5_POSITION                   equ 0005h
WDTPSL_PSCNT5_SIZE                       equ 0001h
WDTPSL_PSCNT5_LENGTH                     equ 0001h
WDTPSL_PSCNT5_MASK                       equ 0020h
WDTPSL_PSCNT6_POSN                       equ 0006h
WDTPSL_PSCNT6_POSITION                   equ 0006h
WDTPSL_PSCNT6_SIZE                       equ 0001h
WDTPSL_PSCNT6_LENGTH                     equ 0001h
WDTPSL_PSCNT6_MASK                       equ 0040h
WDTPSL_PSCNT7_POSN                       equ 0007h
WDTPSL_PSCNT7_POSITION                   equ 0007h
WDTPSL_PSCNT7_SIZE                       equ 0001h
WDTPSL_PSCNT7_LENGTH                     equ 0001h
WDTPSL_PSCNT7_MASK                       equ 0080h
WDTPSL_WDTPSCNT_POSN                     equ 0000h
WDTPSL_WDTPSCNT_POSITION                 equ 0000h
WDTPSL_WDTPSCNT_SIZE                     equ 0008h
WDTPSL_WDTPSCNT_LENGTH                   equ 0008h
WDTPSL_WDTPSCNT_MASK                     equ 00FFh
WDTPSL_WDTPSCNT0_POSN                    equ 0000h
WDTPSL_WDTPSCNT0_POSITION                equ 0000h
WDTPSL_WDTPSCNT0_SIZE                    equ 0001h
WDTPSL_WDTPSCNT0_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT0_MASK                    equ 0001h
WDTPSL_WDTPSCNT1_POSN                    equ 0001h
WDTPSL_WDTPSCNT1_POSITION                equ 0001h
WDTPSL_WDTPSCNT1_SIZE                    equ 0001h
WDTPSL_WDTPSCNT1_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT1_MASK                    equ 0002h
WDTPSL_WDTPSCNT2_POSN                    equ 0002h
WDTPSL_WDTPSCNT2_POSITION                equ 0002h
WDTPSL_WDTPSCNT2_SIZE                    equ 0001h
WDTPSL_WDTPSCNT2_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT2_MASK                    equ 0004h
WDTPSL_WDTPSCNT3_POSN                    equ 0003h
WDTPSL_WDTPSCNT3_POSITION                equ 0003h
WDTPSL_WDTPSCNT3_SIZE                    equ 0001h
WDTPSL_WDTPSCNT3_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT3_MASK                    equ 0008h
WDTPSL_WDTPSCNT4_POSN                    equ 0004h
WDTPSL_WDTPSCNT4_POSITION                equ 0004h
WDTPSL_WDTPSCNT4_SIZE                    equ 0001h
WDTPSL_WDTPSCNT4_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT4_MASK                    equ 0010h
WDTPSL_WDTPSCNT5_POSN                    equ 0005h
WDTPSL_WDTPSCNT5_POSITION                equ 0005h
WDTPSL_WDTPSCNT5_SIZE                    equ 0001h
WDTPSL_WDTPSCNT5_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT5_MASK                    equ 0020h
WDTPSL_WDTPSCNT6_POSN                    equ 0006h
WDTPSL_WDTPSCNT6_POSITION                equ 0006h
WDTPSL_WDTPSCNT6_SIZE                    equ 0001h
WDTPSL_WDTPSCNT6_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT6_MASK                    equ 0040h
WDTPSL_WDTPSCNT7_POSN                    equ 0007h
WDTPSL_WDTPSCNT7_POSITION                equ 0007h
WDTPSL_WDTPSCNT7_SIZE                    equ 0001h
WDTPSL_WDTPSCNT7_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT7_MASK                    equ 0080h

// Register: WDTPSH
#define WDTPSH WDTPSH
WDTPSH                                   equ 0714h
// bitfield definitions
WDTPSH_PSCNT_POSN                        equ 0000h
WDTPSH_PSCNT_POSITION                    equ 0000h
WDTPSH_PSCNT_SIZE                        equ 0008h
WDTPSH_PSCNT_LENGTH                      equ 0008h
WDTPSH_PSCNT_MASK                        equ 00FFh
WDTPSH_PSCNT8_POSN                       equ 0000h
WDTPSH_PSCNT8_POSITION                   equ 0000h
WDTPSH_PSCNT8_SIZE                       equ 0001h
WDTPSH_PSCNT8_LENGTH                     equ 0001h
WDTPSH_PSCNT8_MASK                       equ 0001h
WDTPSH_PSCNT9_POSN                       equ 0001h
WDTPSH_PSCNT9_POSITION                   equ 0001h
WDTPSH_PSCNT9_SIZE                       equ 0001h
WDTPSH_PSCNT9_LENGTH                     equ 0001h
WDTPSH_PSCNT9_MASK                       equ 0002h
WDTPSH_PSCNT10_POSN                      equ 0002h
WDTPSH_PSCNT10_POSITION                  equ 0002h
WDTPSH_PSCNT10_SIZE                      equ 0001h
WDTPSH_PSCNT10_LENGTH                    equ 0001h
WDTPSH_PSCNT10_MASK                      equ 0004h
WDTPSH_PSCNT11_POSN                      equ 0003h
WDTPSH_PSCNT11_POSITION                  equ 0003h
WDTPSH_PSCNT11_SIZE                      equ 0001h
WDTPSH_PSCNT11_LENGTH                    equ 0001h
WDTPSH_PSCNT11_MASK                      equ 0008h
WDTPSH_PSCNT12_POSN                      equ 0004h
WDTPSH_PSCNT12_POSITION                  equ 0004h
WDTPSH_PSCNT12_SIZE                      equ 0001h
WDTPSH_PSCNT12_LENGTH                    equ 0001h
WDTPSH_PSCNT12_MASK                      equ 0010h
WDTPSH_PSCNT13_POSN                      equ 0005h
WDTPSH_PSCNT13_POSITION                  equ 0005h
WDTPSH_PSCNT13_SIZE                      equ 0001h
WDTPSH_PSCNT13_LENGTH                    equ 0001h
WDTPSH_PSCNT13_MASK                      equ 0020h
WDTPSH_PSCNT14_POSN                      equ 0006h
WDTPSH_PSCNT14_POSITION                  equ 0006h
WDTPSH_PSCNT14_SIZE                      equ 0001h
WDTPSH_PSCNT14_LENGTH                    equ 0001h
WDTPSH_PSCNT14_MASK                      equ 0040h
WDTPSH_PSCNT15_POSN                      equ 0007h
WDTPSH_PSCNT15_POSITION                  equ 0007h
WDTPSH_PSCNT15_SIZE                      equ 0001h
WDTPSH_PSCNT15_LENGTH                    equ 0001h
WDTPSH_PSCNT15_MASK                      equ 0080h
WDTPSH_WDTPSCNT_POSN                     equ 0000h
WDTPSH_WDTPSCNT_POSITION                 equ 0000h
WDTPSH_WDTPSCNT_SIZE                     equ 0008h
WDTPSH_WDTPSCNT_LENGTH                   equ 0008h
WDTPSH_WDTPSCNT_MASK                     equ 00FFh
WDTPSH_WDTPSCNT8_POSN                    equ 0000h
WDTPSH_WDTPSCNT8_POSITION                equ 0000h
WDTPSH_WDTPSCNT8_SIZE                    equ 0001h
WDTPSH_WDTPSCNT8_LENGTH                  equ 0001h
WDTPSH_WDTPSCNT8_MASK                    equ 0001h
WDTPSH_WDTPSCNT9_POSN                    equ 0001h
WDTPSH_WDTPSCNT9_POSITION                equ 0001h
WDTPSH_WDTPSCNT9_SIZE                    equ 0001h
WDTPSH_WDTPSCNT9_LENGTH                  equ 0001h
WDTPSH_WDTPSCNT9_MASK                    equ 0002h
WDTPSH_WDTPSCNT10_POSN                   equ 0002h
WDTPSH_WDTPSCNT10_POSITION               equ 0002h
WDTPSH_WDTPSCNT10_SIZE                   equ 0001h
WDTPSH_WDTPSCNT10_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT10_MASK                   equ 0004h
WDTPSH_WDTPSCNT11_POSN                   equ 0003h
WDTPSH_WDTPSCNT11_POSITION               equ 0003h
WDTPSH_WDTPSCNT11_SIZE                   equ 0001h
WDTPSH_WDTPSCNT11_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT11_MASK                   equ 0008h
WDTPSH_WDTPSCNT12_POSN                   equ 0004h
WDTPSH_WDTPSCNT12_POSITION               equ 0004h
WDTPSH_WDTPSCNT12_SIZE                   equ 0001h
WDTPSH_WDTPSCNT12_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT12_MASK                   equ 0010h
WDTPSH_WDTPSCNT13_POSN                   equ 0005h
WDTPSH_WDTPSCNT13_POSITION               equ 0005h
WDTPSH_WDTPSCNT13_SIZE                   equ 0001h
WDTPSH_WDTPSCNT13_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT13_MASK                   equ 0020h
WDTPSH_WDTPSCNT14_POSN                   equ 0006h
WDTPSH_WDTPSCNT14_POSITION               equ 0006h
WDTPSH_WDTPSCNT14_SIZE                   equ 0001h
WDTPSH_WDTPSCNT14_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT14_MASK                   equ 0040h
WDTPSH_WDTPSCNT15_POSN                   equ 0007h
WDTPSH_WDTPSCNT15_POSITION               equ 0007h
WDTPSH_WDTPSCNT15_SIZE                   equ 0001h
WDTPSH_WDTPSCNT15_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT15_MASK                   equ 0080h

// Register: WDTTMR
#define WDTTMR WDTTMR
WDTTMR                                   equ 0715h
// bitfield definitions
WDTTMR_PSCNT16_POSN                      equ 0000h
WDTTMR_PSCNT16_POSITION                  equ 0000h
WDTTMR_PSCNT16_SIZE                      equ 0001h
WDTTMR_PSCNT16_LENGTH                    equ 0001h
WDTTMR_PSCNT16_MASK                      equ 0001h
WDTTMR_PSCNT17_POSN                      equ 0001h
WDTTMR_PSCNT17_POSITION                  equ 0001h
WDTTMR_PSCNT17_SIZE                      equ 0001h
WDTTMR_PSCNT17_LENGTH                    equ 0001h
WDTTMR_PSCNT17_MASK                      equ 0002h
WDTTMR_STATE_POSN                        equ 0002h
WDTTMR_STATE_POSITION                    equ 0002h
WDTTMR_STATE_SIZE                        equ 0001h
WDTTMR_STATE_LENGTH                      equ 0001h
WDTTMR_STATE_MASK                        equ 0004h
WDTTMR_WDTTMR_POSN                       equ 0003h
WDTTMR_WDTTMR_POSITION                   equ 0003h
WDTTMR_WDTTMR_SIZE                       equ 0005h
WDTTMR_WDTTMR_LENGTH                     equ 0005h
WDTTMR_WDTTMR_MASK                       equ 00F8h
WDTTMR_WDTPSCNT16_POSN                   equ 0000h
WDTTMR_WDTPSCNT16_POSITION               equ 0000h
WDTTMR_WDTPSCNT16_SIZE                   equ 0001h
WDTTMR_WDTPSCNT16_LENGTH                 equ 0001h
WDTTMR_WDTPSCNT16_MASK                   equ 0001h
WDTTMR_WDTPSCNT17_POSN                   equ 0001h
WDTTMR_WDTPSCNT17_POSITION               equ 0001h
WDTTMR_WDTPSCNT17_SIZE                   equ 0001h
WDTTMR_WDTPSCNT17_LENGTH                 equ 0001h
WDTTMR_WDTPSCNT17_MASK                   equ 0002h
WDTTMR_WDTSTATE_POSN                     equ 0002h
WDTTMR_WDTSTATE_POSITION                 equ 0002h
WDTTMR_WDTSTATE_SIZE                     equ 0001h
WDTTMR_WDTSTATE_LENGTH                   equ 0001h
WDTTMR_WDTSTATE_MASK                     equ 0004h
WDTTMR_WDTTMR0_POSN                      equ 0003h
WDTTMR_WDTTMR0_POSITION                  equ 0003h
WDTTMR_WDTTMR0_SIZE                      equ 0001h
WDTTMR_WDTTMR0_LENGTH                    equ 0001h
WDTTMR_WDTTMR0_MASK                      equ 0008h
WDTTMR_WDTTMR1_POSN                      equ 0004h
WDTTMR_WDTTMR1_POSITION                  equ 0004h
WDTTMR_WDTTMR1_SIZE                      equ 0001h
WDTTMR_WDTTMR1_LENGTH                    equ 0001h
WDTTMR_WDTTMR1_MASK                      equ 0010h
WDTTMR_WDTTMR2_POSN                      equ 0005h
WDTTMR_WDTTMR2_POSITION                  equ 0005h
WDTTMR_WDTTMR2_SIZE                      equ 0001h
WDTTMR_WDTTMR2_LENGTH                    equ 0001h
WDTTMR_WDTTMR2_MASK                      equ 0020h
WDTTMR_WDTTMR3_POSN                      equ 0006h
WDTTMR_WDTTMR3_POSITION                  equ 0006h
WDTTMR_WDTTMR3_SIZE                      equ 0001h
WDTTMR_WDTTMR3_LENGTH                    equ 0001h
WDTTMR_WDTTMR3_MASK                      equ 0040h
WDTTMR_WDTTMR4_POSN                      equ 0007h
WDTTMR_WDTTMR4_POSITION                  equ 0007h
WDTTMR_WDTTMR4_SIZE                      equ 0001h
WDTTMR_WDTTMR4_LENGTH                    equ 0001h
WDTTMR_WDTTMR4_MASK                      equ 0080h

