GopalSaraf/Practicals/PSDL/include/proc/pic16lf1615.inc
// Register: AT1CON0
#define AT1CON0 AT1CON0
AT1CON0                                  equ 0814h
// bitfield definitions
AT1CON0_MODE_POSN                        equ 0000h
AT1CON0_MODE_POSITION                    equ 0000h
AT1CON0_MODE_SIZE                        equ 0001h
AT1CON0_MODE_LENGTH                      equ 0001h
AT1CON0_MODE_MASK                        equ 0001h
AT1CON0_APMOD_POSN                       equ 0001h
AT1CON0_APMOD_POSITION                   equ 0001h
AT1CON0_APMOD_SIZE                       equ 0001h
AT1CON0_APMOD_LENGTH                     equ 0001h
AT1CON0_APMOD_MASK                       equ 0002h
AT1CON0_POL_POSN                         equ 0003h
AT1CON0_POL_POSITION                     equ 0003h
AT1CON0_POL_SIZE                         equ 0001h
AT1CON0_POL_LENGTH                       equ 0001h
AT1CON0_POL_MASK                         equ 0008h
AT1CON0_PS_POSN                          equ 0004h
AT1CON0_PS_POSITION                      equ 0004h
AT1CON0_PS_SIZE                          equ 0002h
AT1CON0_PS_LENGTH                        equ 0002h
AT1CON0_PS_MASK                          equ 0030h
AT1CON0_PREC_POSN                        equ 0006h
AT1CON0_PREC_POSITION                    equ 0006h
AT1CON0_PREC_SIZE                        equ 0001h
AT1CON0_PREC_LENGTH                      equ 0001h
AT1CON0_PREC_MASK                        equ 0040h
AT1CON0_EN_POSN                          equ 0007h
AT1CON0_EN_POSITION                      equ 0007h
AT1CON0_EN_SIZE                          equ 0001h
AT1CON0_EN_LENGTH                        equ 0001h
AT1CON0_EN_MASK                          equ 0080h
AT1CON0_PS0_POSN                         equ 0004h
AT1CON0_PS0_POSITION                     equ 0004h
AT1CON0_PS0_SIZE                         equ 0001h
AT1CON0_PS0_LENGTH                       equ 0001h
AT1CON0_PS0_MASK                         equ 0010h
AT1CON0_PS1_POSN                         equ 0005h
AT1CON0_PS1_POSITION                     equ 0005h
AT1CON0_PS1_SIZE                         equ 0001h
AT1CON0_PS1_LENGTH                       equ 0001h
AT1CON0_PS1_MASK                         equ 0020h
AT1CON0_AT1MODE_POSN                     equ 0000h
AT1CON0_AT1MODE_POSITION                 equ 0000h
AT1CON0_AT1MODE_SIZE                     equ 0001h
AT1CON0_AT1MODE_LENGTH                   equ 0001h
AT1CON0_AT1MODE_MASK                     equ 0001h
AT1CON0_AT1APMOD_POSN                    equ 0001h
AT1CON0_AT1APMOD_POSITION                equ 0001h
AT1CON0_AT1APMOD_SIZE                    equ 0001h
AT1CON0_AT1APMOD_LENGTH                  equ 0001h
AT1CON0_AT1APMOD_MASK                    equ 0002h
AT1CON0_AT1POL_POSN                      equ 0003h
AT1CON0_AT1POL_POSITION                  equ 0003h
AT1CON0_AT1POL_SIZE                      equ 0001h
AT1CON0_AT1POL_LENGTH                    equ 0001h
AT1CON0_AT1POL_MASK                      equ 0008h
AT1CON0_AT1PS_POSN                       equ 0004h
AT1CON0_AT1PS_POSITION                   equ 0004h
AT1CON0_AT1PS_SIZE                       equ 0002h
AT1CON0_AT1PS_LENGTH                     equ 0002h
AT1CON0_AT1PS_MASK                       equ 0030h
AT1CON0_AT1PREC_POSN                     equ 0006h
AT1CON0_AT1PREC_POSITION                 equ 0006h
AT1CON0_AT1PREC_SIZE                     equ 0001h
AT1CON0_AT1PREC_LENGTH                   equ 0001h
AT1CON0_AT1PREC_MASK                     equ 0040h
AT1CON0_AT1EN_POSN                       equ 0007h
AT1CON0_AT1EN_POSITION                   equ 0007h
AT1CON0_AT1EN_SIZE                       equ 0001h
AT1CON0_AT1EN_LENGTH                     equ 0001h
AT1CON0_AT1EN_MASK                       equ 0080h
AT1CON0_AT1PS0_POSN                      equ 0004h
AT1CON0_AT1PS0_POSITION                  equ 0004h
AT1CON0_AT1PS0_SIZE                      equ 0001h
AT1CON0_AT1PS0_LENGTH                    equ 0001h
AT1CON0_AT1PS0_MASK                      equ 0010h
AT1CON0_AT1PS1_POSN                      equ 0005h
AT1CON0_AT1PS1_POSITION                  equ 0005h
AT1CON0_AT1PS1_SIZE                      equ 0001h
AT1CON0_AT1PS1_LENGTH                    equ 0001h
AT1CON0_AT1PS1_MASK                      equ 0020h

// Register: AT1CON1
#define AT1CON1 AT1CON1
AT1CON1                                  equ 0815h
// bitfield definitions
AT1CON1_VALID_POSN                       equ 0000h
AT1CON1_VALID_POSITION                   equ 0000h
AT1CON1_VALID_SIZE                       equ 0001h
AT1CON1_VALID_LENGTH                     equ 0001h
AT1CON1_VALID_MASK                       equ 0001h
AT1CON1_ACCS_POSN                        equ 0001h
AT1CON1_ACCS_POSITION                    equ 0001h
AT1CON1_ACCS_SIZE                        equ 0001h
AT1CON1_ACCS_LENGTH                      equ 0001h
AT1CON1_ACCS_MASK                        equ 0002h
AT1CON1_MPP_POSN                         equ 0002h
AT1CON1_MPP_POSITION                     equ 0002h
AT1CON1_MPP_SIZE                         equ 0001h
AT1CON1_MPP_LENGTH                       equ 0001h
AT1CON1_MPP_MASK                         equ 0004h
AT1CON1_PRP_POSN                         equ 0004h
AT1CON1_PRP_POSITION                     equ 0004h
AT1CON1_PRP_SIZE                         equ 0001h
AT1CON1_PRP_LENGTH                       equ 0001h
AT1CON1_PRP_MASK                         equ 0010h
AT1CON1_PHP_POSN                         equ 0006h
AT1CON1_PHP_POSITION                     equ 0006h
AT1CON1_PHP_SIZE                         equ 0001h
AT1CON1_PHP_LENGTH                       equ 0001h
AT1CON1_PHP_MASK                         equ 0040h
AT1CON1_AT1VALID_POSN                    equ 0000h
AT1CON1_AT1VALID_POSITION                equ 0000h
AT1CON1_AT1VALID_SIZE                    equ 0001h
AT1CON1_AT1VALID_LENGTH                  equ 0001h
AT1CON1_AT1VALID_MASK                    equ 0001h
AT1CON1_AT1ACCS_POSN                     equ 0001h
AT1CON1_AT1ACCS_POSITION                 equ 0001h
AT1CON1_AT1ACCS_SIZE                     equ 0001h
AT1CON1_AT1ACCS_LENGTH                   equ 0001h
AT1CON1_AT1ACCS_MASK                     equ 0002h
AT1CON1_AT1MPP_POSN                      equ 0002h
AT1CON1_AT1MPP_POSITION                  equ 0002h
AT1CON1_AT1MPP_SIZE                      equ 0001h
AT1CON1_AT1MPP_LENGTH                    equ 0001h
AT1CON1_AT1MPP_MASK                      equ 0004h
AT1CON1_AT1PRP_POSN                      equ 0004h
AT1CON1_AT1PRP_POSITION                  equ 0004h
AT1CON1_AT1PRP_SIZE                      equ 0001h
AT1CON1_AT1PRP_LENGTH                    equ 0001h
AT1CON1_AT1PRP_MASK                      equ 0010h
AT1CON1_AT1PHP_POSN                      equ 0006h
AT1CON1_AT1PHP_POSITION                  equ 0006h
AT1CON1_AT1PHP_SIZE                      equ 0001h
AT1CON1_AT1PHP_LENGTH                    equ 0001h
AT1CON1_AT1PHP_MASK                      equ 0040h

// Register: AT1IR0
#define AT1IR0 AT1IR0
AT1IR0                                   equ 0816h
// bitfield definitions
AT1IR0_AT1PERIF_POSN                     equ 0000h
AT1IR0_AT1PERIF_POSITION                 equ 0000h
AT1IR0_AT1PERIF_SIZE                     equ 0001h
AT1IR0_AT1PERIF_LENGTH                   equ 0001h
AT1IR0_AT1PERIF_MASK                     equ 0001h
AT1IR0_AT1MISSIF_POSN                    equ 0001h
AT1IR0_AT1MISSIF_POSITION                equ 0001h
AT1IR0_AT1MISSIF_SIZE                    equ 0001h
AT1IR0_AT1MISSIF_LENGTH                  equ 0001h
AT1IR0_AT1MISSIF_MASK                    equ 0002h
AT1IR0_AT1PHSIF_POSN                     equ 0002h
AT1IR0_AT1PHSIF_POSITION                 equ 0002h
AT1IR0_AT1PHSIF_SIZE                     equ 0001h
AT1IR0_AT1PHSIF_LENGTH                   equ 0001h
AT1IR0_AT1PHSIF_MASK                     equ 0004h

// Register: AT1IE0
#define AT1IE0 AT1IE0
AT1IE0                                   equ 0817h
// bitfield definitions
AT1IE0_AT1PERIE_POSN                     equ 0000h
AT1IE0_AT1PERIE_POSITION                 equ 0000h
AT1IE0_AT1PERIE_SIZE                     equ 0001h
AT1IE0_AT1PERIE_LENGTH                   equ 0001h
AT1IE0_AT1PERIE_MASK                     equ 0001h
AT1IE0_AT1MISSIE_POSN                    equ 0001h
AT1IE0_AT1MISSIE_POSITION                equ 0001h
AT1IE0_AT1MISSIE_SIZE                    equ 0001h
AT1IE0_AT1MISSIE_LENGTH                  equ 0001h
AT1IE0_AT1MISSIE_MASK                    equ 0002h
AT1IE0_AT1PHSIE_POSN                     equ 0002h
AT1IE0_AT1PHSIE_POSITION                 equ 0002h
AT1IE0_AT1PHSIE_SIZE                     equ 0001h
AT1IE0_AT1PHSIE_LENGTH                   equ 0001h
AT1IE0_AT1PHSIE_MASK                     equ 0004h

// Register: AT1IR1
#define AT1IR1 AT1IR1
AT1IR1                                   equ 0818h
// bitfield definitions
AT1IR1_AT1CC1IF_POSN                     equ 0000h
AT1IR1_AT1CC1IF_POSITION                 equ 0000h
AT1IR1_AT1CC1IF_SIZE                     equ 0001h
AT1IR1_AT1CC1IF_LENGTH                   equ 0001h
AT1IR1_AT1CC1IF_MASK                     equ 0001h
AT1IR1_AT1CC2IF_POSN                     equ 0001h
AT1IR1_AT1CC2IF_POSITION                 equ 0001h
AT1IR1_AT1CC2IF_SIZE                     equ 0001h
AT1IR1_AT1CC2IF_LENGTH                   equ 0001h
AT1IR1_AT1CC2IF_MASK                     equ 0002h
AT1IR1_AT1CC3IF_POSN                     equ 0002h
AT1IR1_AT1CC3IF_POSITION                 equ 0002h
AT1IR1_AT1CC3IF_SIZE                     equ 0001h
AT1IR1_AT1CC3IF_LENGTH                   equ 0001h
AT1IR1_AT1CC3IF_MASK                     equ 0004h

// Register: AT1IE1
#define AT1IE1 AT1IE1
AT1IE1                                   equ 0819h
// bitfield definitions
AT1IE1_AT1CC1IE_POSN                     equ 0000h
AT1IE1_AT1CC1IE_POSITION                 equ 0000h
AT1IE1_AT1CC1IE_SIZE                     equ 0001h
AT1IE1_AT1CC1IE_LENGTH                   equ 0001h
AT1IE1_AT1CC1IE_MASK                     equ 0001h
AT1IE1_AT1CC2IE_POSN                     equ 0001h
AT1IE1_AT1CC2IE_POSITION                 equ 0001h
AT1IE1_AT1CC2IE_SIZE                     equ 0001h
AT1IE1_AT1CC2IE_LENGTH                   equ 0001h
AT1IE1_AT1CC2IE_MASK                     equ 0002h
AT1IE1_AT1CC3IE_POSN                     equ 0002h
AT1IE1_AT1CC3IE_POSITION                 equ 0002h
AT1IE1_AT1CC3IE_SIZE                     equ 0001h
AT1IE1_AT1CC3IE_LENGTH                   equ 0001h
AT1IE1_AT1CC3IE_MASK                     equ 0004h

// Register: AT1STPTL
#define AT1STPTL AT1STPTL
AT1STPTL                                 equ 081Ah
// bitfield definitions
AT1STPTL_AT1STPT0_POSN                   equ 0000h
AT1STPTL_AT1STPT0_POSITION               equ 0000h
AT1STPTL_AT1STPT0_SIZE                   equ 0001h
AT1STPTL_AT1STPT0_LENGTH                 equ 0001h
AT1STPTL_AT1STPT0_MASK                   equ 0001h
AT1STPTL_AT1STPT1_POSN                   equ 0001h
AT1STPTL_AT1STPT1_POSITION               equ 0001h
AT1STPTL_AT1STPT1_SIZE                   equ 0001h
AT1STPTL_AT1STPT1_LENGTH                 equ 0001h
AT1STPTL_AT1STPT1_MASK                   equ 0002h
AT1STPTL_AT1STPT2_POSN                   equ 0002h
AT1STPTL_AT1STPT2_POSITION               equ 0002h
AT1STPTL_AT1STPT2_SIZE                   equ 0001h
AT1STPTL_AT1STPT2_LENGTH                 equ 0001h
AT1STPTL_AT1STPT2_MASK                   equ 0004h
AT1STPTL_AT1STPT3_POSN                   equ 0003h
AT1STPTL_AT1STPT3_POSITION               equ 0003h
AT1STPTL_AT1STPT3_SIZE                   equ 0001h
AT1STPTL_AT1STPT3_LENGTH                 equ 0001h
AT1STPTL_AT1STPT3_MASK                   equ 0008h
AT1STPTL_AT1STPT4_POSN                   equ 0004h
AT1STPTL_AT1STPT4_POSITION               equ 0004h
AT1STPTL_AT1STPT4_SIZE                   equ 0001h
AT1STPTL_AT1STPT4_LENGTH                 equ 0001h
AT1STPTL_AT1STPT4_MASK                   equ 0010h
AT1STPTL_AT1STPT5_POSN                   equ 0005h
AT1STPTL_AT1STPT5_POSITION               equ 0005h
AT1STPTL_AT1STPT5_SIZE                   equ 0001h
AT1STPTL_AT1STPT5_LENGTH                 equ 0001h
AT1STPTL_AT1STPT5_MASK                   equ 0020h
AT1STPTL_AT1STPT6_POSN                   equ 0006h
AT1STPTL_AT1STPT6_POSITION               equ 0006h
AT1STPTL_AT1STPT6_SIZE                   equ 0001h
AT1STPTL_AT1STPT6_LENGTH                 equ 0001h
AT1STPTL_AT1STPT6_MASK                   equ 0040h
AT1STPTL_AT1STPT7_POSN                   equ 0007h
AT1STPTL_AT1STPT7_POSITION               equ 0007h
AT1STPTL_AT1STPT7_SIZE                   equ 0001h
AT1STPTL_AT1STPT7_LENGTH                 equ 0001h
AT1STPTL_AT1STPT7_MASK                   equ 0080h
AT1STPTL_STPT0_POSN                      equ 0000h
AT1STPTL_STPT0_POSITION                  equ 0000h
AT1STPTL_STPT0_SIZE                      equ 0001h
AT1STPTL_STPT0_LENGTH                    equ 0001h
AT1STPTL_STPT0_MASK                      equ 0001h
AT1STPTL_STPT1_POSN                      equ 0001h
AT1STPTL_STPT1_POSITION                  equ 0001h
AT1STPTL_STPT1_SIZE                      equ 0001h
AT1STPTL_STPT1_LENGTH                    equ 0001h
AT1STPTL_STPT1_MASK                      equ 0002h
AT1STPTL_STPT2_POSN                      equ 0002h
AT1STPTL_STPT2_POSITION                  equ 0002h
AT1STPTL_STPT2_SIZE                      equ 0001h
AT1STPTL_STPT2_LENGTH                    equ 0001h
AT1STPTL_STPT2_MASK                      equ 0004h
AT1STPTL_STPT3_POSN                      equ 0003h
AT1STPTL_STPT3_POSITION                  equ 0003h
AT1STPTL_STPT3_SIZE                      equ 0001h
AT1STPTL_STPT3_LENGTH                    equ 0001h
AT1STPTL_STPT3_MASK                      equ 0008h
AT1STPTL_STPT4_POSN                      equ 0004h
AT1STPTL_STPT4_POSITION                  equ 0004h
AT1STPTL_STPT4_SIZE                      equ 0001h
AT1STPTL_STPT4_LENGTH                    equ 0001h
AT1STPTL_STPT4_MASK                      equ 0010h
AT1STPTL_STPT5_POSN                      equ 0005h
AT1STPTL_STPT5_POSITION                  equ 0005h
AT1STPTL_STPT5_SIZE                      equ 0001h
AT1STPTL_STPT5_LENGTH                    equ 0001h
AT1STPTL_STPT5_MASK                      equ 0020h
AT1STPTL_STPT6_POSN                      equ 0006h
AT1STPTL_STPT6_POSITION                  equ 0006h
AT1STPTL_STPT6_SIZE                      equ 0001h
AT1STPTL_STPT6_LENGTH                    equ 0001h
AT1STPTL_STPT6_MASK                      equ 0040h
AT1STPTL_STPT7_POSN                      equ 0007h
AT1STPTL_STPT7_POSITION                  equ 0007h
AT1STPTL_STPT7_SIZE                      equ 0001h
AT1STPTL_STPT7_LENGTH                    equ 0001h
AT1STPTL_STPT7_MASK                      equ 0080h

// Register: AT1STPTH
#define AT1STPTH AT1STPTH
AT1STPTH                                 equ 081Bh
// bitfield definitions
AT1STPTH_AT1STPT8_POSN                   equ 0000h
AT1STPTH_AT1STPT8_POSITION               equ 0000h
AT1STPTH_AT1STPT8_SIZE                   equ 0001h
AT1STPTH_AT1STPT8_LENGTH                 equ 0001h
AT1STPTH_AT1STPT8_MASK                   equ 0001h
AT1STPTH_AT1STPT9_POSN                   equ 0001h
AT1STPTH_AT1STPT9_POSITION               equ 0001h
AT1STPTH_AT1STPT9_SIZE                   equ 0001h
AT1STPTH_AT1STPT9_LENGTH                 equ 0001h
AT1STPTH_AT1STPT9_MASK                   equ 0002h
AT1STPTH_AT1STPT10_POSN                  equ 0002h
AT1STPTH_AT1STPT10_POSITION              equ 0002h
AT1STPTH_AT1STPT10_SIZE                  equ 0001h
AT1STPTH_AT1STPT10_LENGTH                equ 0001h
AT1STPTH_AT1STPT10_MASK                  equ 0004h
AT1STPTH_AT1STPT11_POSN                  equ 0003h
AT1STPTH_AT1STPT11_POSITION              equ 0003h
AT1STPTH_AT1STPT11_SIZE                  equ 0001h
AT1STPTH_AT1STPT11_LENGTH                equ 0001h
AT1STPTH_AT1STPT11_MASK                  equ 0008h
AT1STPTH_AT1STPT12_POSN                  equ 0004h
AT1STPTH_AT1STPT12_POSITION              equ 0004h
AT1STPTH_AT1STPT12_SIZE                  equ 0001h
AT1STPTH_AT1STPT12_LENGTH                equ 0001h
AT1STPTH_AT1STPT12_MASK                  equ 0010h
AT1STPTH_AT1STPT13_POSN                  equ 0005h
AT1STPTH_AT1STPT13_POSITION              equ 0005h
AT1STPTH_AT1STPT13_SIZE                  equ 0001h
AT1STPTH_AT1STPT13_LENGTH                equ 0001h
AT1STPTH_AT1STPT13_MASK                  equ 0020h
AT1STPTH_AT1STPT14_POSN                  equ 0006h
AT1STPTH_AT1STPT14_POSITION              equ 0006h
AT1STPTH_AT1STPT14_SIZE                  equ 0001h
AT1STPTH_AT1STPT14_LENGTH                equ 0001h
AT1STPTH_AT1STPT14_MASK                  equ 0040h
AT1STPTH_STPT8_POSN                      equ 0000h
AT1STPTH_STPT8_POSITION                  equ 0000h
AT1STPTH_STPT8_SIZE                      equ 0001h
AT1STPTH_STPT8_LENGTH                    equ 0001h
AT1STPTH_STPT8_MASK                      equ 0001h
AT1STPTH_STPT9_POSN                      equ 0001h
AT1STPTH_STPT9_POSITION                  equ 0001h
AT1STPTH_STPT9_SIZE                      equ 0001h
AT1STPTH_STPT9_LENGTH                    equ 0001h
AT1STPTH_STPT9_MASK                      equ 0002h
AT1STPTH_STPT10_POSN                     equ 0002h
AT1STPTH_STPT10_POSITION                 equ 0002h
AT1STPTH_STPT10_SIZE                     equ 0001h
AT1STPTH_STPT10_LENGTH                   equ 0001h
AT1STPTH_STPT10_MASK                     equ 0004h
AT1STPTH_STPT11_POSN                     equ 0003h
AT1STPTH_STPT11_POSITION                 equ 0003h
AT1STPTH_STPT11_SIZE                     equ 0001h
AT1STPTH_STPT11_LENGTH                   equ 0001h
AT1STPTH_STPT11_MASK                     equ 0008h
AT1STPTH_STPT12_POSN                     equ 0004h
AT1STPTH_STPT12_POSITION                 equ 0004h
AT1STPTH_STPT12_SIZE                     equ 0001h
AT1STPTH_STPT12_LENGTH                   equ 0001h
AT1STPTH_STPT12_MASK                     equ 0010h
AT1STPTH_STPT13_POSN                     equ 0005h
AT1STPTH_STPT13_POSITION                 equ 0005h
AT1STPTH_STPT13_SIZE                     equ 0001h
AT1STPTH_STPT13_LENGTH                   equ 0001h
AT1STPTH_STPT13_MASK                     equ 0020h
AT1STPTH_STPT14_POSN                     equ 0006h
AT1STPTH_STPT14_POSITION                 equ 0006h
AT1STPTH_STPT14_SIZE                     equ 0001h
AT1STPTH_STPT14_LENGTH                   equ 0001h
AT1STPTH_STPT14_MASK                     equ 0040h

