GopalSaraf/Practicals/PSDL/include/proc/pic16lf1615.inc
// Register: SMT2TMRL
#define SMT2TMRL SMT2TMRL
SMT2TMRL                                 equ 0D9Eh
// bitfield definitions
SMT2TMRL_SMT2TMR_POSN                    equ 0000h
SMT2TMRL_SMT2TMR_POSITION                equ 0000h
SMT2TMRL_SMT2TMR_SIZE                    equ 0008h
SMT2TMRL_SMT2TMR_LENGTH                  equ 0008h
SMT2TMRL_SMT2TMR_MASK                    equ 00FFh
SMT2TMRL_SMT2TMR0_POSN                   equ 0000h
SMT2TMRL_SMT2TMR0_POSITION               equ 0000h
SMT2TMRL_SMT2TMR0_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR0_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR0_MASK                   equ 0001h
SMT2TMRL_SMT2TMR1_POSN                   equ 0001h
SMT2TMRL_SMT2TMR1_POSITION               equ 0001h
SMT2TMRL_SMT2TMR1_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR1_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR1_MASK                   equ 0002h
SMT2TMRL_SMT2TMR2_POSN                   equ 0002h
SMT2TMRL_SMT2TMR2_POSITION               equ 0002h
SMT2TMRL_SMT2TMR2_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR2_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR2_MASK                   equ 0004h
SMT2TMRL_SMT2TMR3_POSN                   equ 0003h
SMT2TMRL_SMT2TMR3_POSITION               equ 0003h
SMT2TMRL_SMT2TMR3_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR3_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR3_MASK                   equ 0008h
SMT2TMRL_SMT2TMR4_POSN                   equ 0004h
SMT2TMRL_SMT2TMR4_POSITION               equ 0004h
SMT2TMRL_SMT2TMR4_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR4_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR4_MASK                   equ 0010h
SMT2TMRL_SMT2TMR5_POSN                   equ 0005h
SMT2TMRL_SMT2TMR5_POSITION               equ 0005h
SMT2TMRL_SMT2TMR5_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR5_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR5_MASK                   equ 0020h
SMT2TMRL_SMT2TMR6_POSN                   equ 0006h
SMT2TMRL_SMT2TMR6_POSITION               equ 0006h
SMT2TMRL_SMT2TMR6_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR6_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR6_MASK                   equ 0040h
SMT2TMRL_SMT2TMR7_POSN                   equ 0007h
SMT2TMRL_SMT2TMR7_POSITION               equ 0007h
SMT2TMRL_SMT2TMR7_SIZE                   equ 0001h
SMT2TMRL_SMT2TMR7_LENGTH                 equ 0001h
SMT2TMRL_SMT2TMR7_MASK                   equ 0080h

// Register: SMT2TMRH
#define SMT2TMRH SMT2TMRH
SMT2TMRH                                 equ 0D9Fh
// bitfield definitions
SMT2TMRH_SMT2TMR_POSN                    equ 0000h
SMT2TMRH_SMT2TMR_POSITION                equ 0000h
SMT2TMRH_SMT2TMR_SIZE                    equ 0008h
SMT2TMRH_SMT2TMR_LENGTH                  equ 0008h
SMT2TMRH_SMT2TMR_MASK                    equ 00FFh
SMT2TMRH_SMT2TMR8_POSN                   equ 0000h
SMT2TMRH_SMT2TMR8_POSITION               equ 0000h
SMT2TMRH_SMT2TMR8_SIZE                   equ 0001h
SMT2TMRH_SMT2TMR8_LENGTH                 equ 0001h
SMT2TMRH_SMT2TMR8_MASK                   equ 0001h
SMT2TMRH_SMT2TMR9_POSN                   equ 0001h
SMT2TMRH_SMT2TMR9_POSITION               equ 0001h
SMT2TMRH_SMT2TMR9_SIZE                   equ 0001h
SMT2TMRH_SMT2TMR9_LENGTH                 equ 0001h
SMT2TMRH_SMT2TMR9_MASK                   equ 0002h
SMT2TMRH_SMT2TMR10_POSN                  equ 0002h
SMT2TMRH_SMT2TMR10_POSITION              equ 0002h
SMT2TMRH_SMT2TMR10_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR10_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR10_MASK                  equ 0004h
SMT2TMRH_SMT2TMR11_POSN                  equ 0003h
SMT2TMRH_SMT2TMR11_POSITION              equ 0003h
SMT2TMRH_SMT2TMR11_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR11_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR11_MASK                  equ 0008h
SMT2TMRH_SMT2TMR12_POSN                  equ 0004h
SMT2TMRH_SMT2TMR12_POSITION              equ 0004h
SMT2TMRH_SMT2TMR12_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR12_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR12_MASK                  equ 0010h
SMT2TMRH_SMT2TMR13_POSN                  equ 0005h
SMT2TMRH_SMT2TMR13_POSITION              equ 0005h
SMT2TMRH_SMT2TMR13_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR13_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR13_MASK                  equ 0020h
SMT2TMRH_SMT2TMR14_POSN                  equ 0006h
SMT2TMRH_SMT2TMR14_POSITION              equ 0006h
SMT2TMRH_SMT2TMR14_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR14_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR14_MASK                  equ 0040h
SMT2TMRH_SMT2TMR15_POSN                  equ 0007h
SMT2TMRH_SMT2TMR15_POSITION              equ 0007h
SMT2TMRH_SMT2TMR15_SIZE                  equ 0001h
SMT2TMRH_SMT2TMR15_LENGTH                equ 0001h
SMT2TMRH_SMT2TMR15_MASK                  equ 0080h

// Register: SMT2TMRU
#define SMT2TMRU SMT2TMRU
SMT2TMRU                                 equ 0DA0h
// bitfield definitions
SMT2TMRU_SMT2TMR_POSN                    equ 0000h
SMT2TMRU_SMT2TMR_POSITION                equ 0000h
SMT2TMRU_SMT2TMR_SIZE                    equ 0008h
SMT2TMRU_SMT2TMR_LENGTH                  equ 0008h
SMT2TMRU_SMT2TMR_MASK                    equ 00FFh
SMT2TMRU_SMT2TMR16_POSN                  equ 0000h
SMT2TMRU_SMT2TMR16_POSITION              equ 0000h
SMT2TMRU_SMT2TMR16_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR16_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR16_MASK                  equ 0001h
SMT2TMRU_SMT2TMR17_POSN                  equ 0001h
SMT2TMRU_SMT2TMR17_POSITION              equ 0001h
SMT2TMRU_SMT2TMR17_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR17_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR17_MASK                  equ 0002h
SMT2TMRU_SMT2TMR18_POSN                  equ 0002h
SMT2TMRU_SMT2TMR18_POSITION              equ 0002h
SMT2TMRU_SMT2TMR18_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR18_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR18_MASK                  equ 0004h
SMT2TMRU_SMT2TMR19_POSN                  equ 0003h
SMT2TMRU_SMT2TMR19_POSITION              equ 0003h
SMT2TMRU_SMT2TMR19_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR19_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR19_MASK                  equ 0008h
SMT2TMRU_SMT2TMR20_POSN                  equ 0004h
SMT2TMRU_SMT2TMR20_POSITION              equ 0004h
SMT2TMRU_SMT2TMR20_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR20_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR20_MASK                  equ 0010h
SMT2TMRU_SMT2TMR21_POSN                  equ 0005h
SMT2TMRU_SMT2TMR21_POSITION              equ 0005h
SMT2TMRU_SMT2TMR21_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR21_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR21_MASK                  equ 0020h
SMT2TMRU_SMT2TMR22_POSN                  equ 0006h
SMT2TMRU_SMT2TMR22_POSITION              equ 0006h
SMT2TMRU_SMT2TMR22_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR22_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR22_MASK                  equ 0040h
SMT2TMRU_SMT2TMR23_POSN                  equ 0007h
SMT2TMRU_SMT2TMR23_POSITION              equ 0007h
SMT2TMRU_SMT2TMR23_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR23_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR23_MASK                  equ 0080h

// Register: SMT2CPRL
#define SMT2CPRL SMT2CPRL
SMT2CPRL                                 equ 0DA1h
// bitfield definitions
SMT2CPRL_SMT2CPR_POSN                    equ 0000h
SMT2CPRL_SMT2CPR_POSITION                equ 0000h
SMT2CPRL_SMT2CPR_SIZE                    equ 0008h
SMT2CPRL_SMT2CPR_LENGTH                  equ 0008h
SMT2CPRL_SMT2CPR_MASK                    equ 00FFh
SMT2CPRL_SMT2CPR0_POSN                   equ 0000h
SMT2CPRL_SMT2CPR0_POSITION               equ 0000h
SMT2CPRL_SMT2CPR0_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR0_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR0_MASK                   equ 0001h
SMT2CPRL_SMT2CPR1_POSN                   equ 0001h
SMT2CPRL_SMT2CPR1_POSITION               equ 0001h
SMT2CPRL_SMT2CPR1_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR1_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR1_MASK                   equ 0002h
SMT2CPRL_SMT2CPR2_POSN                   equ 0002h
SMT2CPRL_SMT2CPR2_POSITION               equ 0002h
SMT2CPRL_SMT2CPR2_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR2_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR2_MASK                   equ 0004h
SMT2CPRL_SMT2CPR3_POSN                   equ 0003h
SMT2CPRL_SMT2CPR3_POSITION               equ 0003h
SMT2CPRL_SMT2CPR3_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR3_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR3_MASK                   equ 0008h
SMT2CPRL_SMT2CPR4_POSN                   equ 0004h
SMT2CPRL_SMT2CPR4_POSITION               equ 0004h
SMT2CPRL_SMT2CPR4_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR4_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR4_MASK                   equ 0010h
SMT2CPRL_SMT2CPR5_POSN                   equ 0005h
SMT2CPRL_SMT2CPR5_POSITION               equ 0005h
SMT2CPRL_SMT2CPR5_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR5_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR5_MASK                   equ 0020h
SMT2CPRL_SMT2CPR6_POSN                   equ 0006h
SMT2CPRL_SMT2CPR6_POSITION               equ 0006h
SMT2CPRL_SMT2CPR6_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR6_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR6_MASK                   equ 0040h
SMT2CPRL_SMT2CPR7_POSN                   equ 0007h
SMT2CPRL_SMT2CPR7_POSITION               equ 0007h
SMT2CPRL_SMT2CPR7_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR7_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR7_MASK                   equ 0080h

