GopalSaraf/Practicals/PSDL/include/proc/pic16lf1615.inc
// Register: CLC3GLS2
#define CLC3GLS2 CLC3GLS2
CLC3GLS2                                 equ 0F2Ch
// bitfield definitions
CLC3GLS2_LC3G3D1N_POSN                   equ 0000h
CLC3GLS2_LC3G3D1N_POSITION               equ 0000h
CLC3GLS2_LC3G3D1N_SIZE                   equ 0001h
CLC3GLS2_LC3G3D1N_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D1N_MASK                   equ 0001h
CLC3GLS2_LC3G3D1T_POSN                   equ 0001h
CLC3GLS2_LC3G3D1T_POSITION               equ 0001h
CLC3GLS2_LC3G3D1T_SIZE                   equ 0001h
CLC3GLS2_LC3G3D1T_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D1T_MASK                   equ 0002h
CLC3GLS2_LC3G3D2N_POSN                   equ 0002h
CLC3GLS2_LC3G3D2N_POSITION               equ 0002h
CLC3GLS2_LC3G3D2N_SIZE                   equ 0001h
CLC3GLS2_LC3G3D2N_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D2N_MASK                   equ 0004h
CLC3GLS2_LC3G3D2T_POSN                   equ 0003h
CLC3GLS2_LC3G3D2T_POSITION               equ 0003h
CLC3GLS2_LC3G3D2T_SIZE                   equ 0001h
CLC3GLS2_LC3G3D2T_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D2T_MASK                   equ 0008h
CLC3GLS2_LC3G3D3N_POSN                   equ 0004h
CLC3GLS2_LC3G3D3N_POSITION               equ 0004h
CLC3GLS2_LC3G3D3N_SIZE                   equ 0001h
CLC3GLS2_LC3G3D3N_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D3N_MASK                   equ 0010h
CLC3GLS2_LC3G3D3T_POSN                   equ 0005h
CLC3GLS2_LC3G3D3T_POSITION               equ 0005h
CLC3GLS2_LC3G3D3T_SIZE                   equ 0001h
CLC3GLS2_LC3G3D3T_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D3T_MASK                   equ 0020h
CLC3GLS2_LC3G3D4N_POSN                   equ 0006h
CLC3GLS2_LC3G3D4N_POSITION               equ 0006h
CLC3GLS2_LC3G3D4N_SIZE                   equ 0001h
CLC3GLS2_LC3G3D4N_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D4N_MASK                   equ 0040h
CLC3GLS2_LC3G3D4T_POSN                   equ 0007h
CLC3GLS2_LC3G3D4T_POSITION               equ 0007h
CLC3GLS2_LC3G3D4T_SIZE                   equ 0001h
CLC3GLS2_LC3G3D4T_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D4T_MASK                   equ 0080h
CLC3GLS2_D1N_POSN                        equ 0000h
CLC3GLS2_D1N_POSITION                    equ 0000h
CLC3GLS2_D1N_SIZE                        equ 0001h
CLC3GLS2_D1N_LENGTH                      equ 0001h
CLC3GLS2_D1N_MASK                        equ 0001h
CLC3GLS2_D1T_POSN                        equ 0001h
CLC3GLS2_D1T_POSITION                    equ 0001h
CLC3GLS2_D1T_SIZE                        equ 0001h
CLC3GLS2_D1T_LENGTH                      equ 0001h
CLC3GLS2_D1T_MASK                        equ 0002h
CLC3GLS2_D2N_POSN                        equ 0002h
CLC3GLS2_D2N_POSITION                    equ 0002h
CLC3GLS2_D2N_SIZE                        equ 0001h
CLC3GLS2_D2N_LENGTH                      equ 0001h
CLC3GLS2_D2N_MASK                        equ 0004h
CLC3GLS2_D2T_POSN                        equ 0003h
CLC3GLS2_D2T_POSITION                    equ 0003h
CLC3GLS2_D2T_SIZE                        equ 0001h
CLC3GLS2_D2T_LENGTH                      equ 0001h
CLC3GLS2_D2T_MASK                        equ 0008h
CLC3GLS2_D3N_POSN                        equ 0004h
CLC3GLS2_D3N_POSITION                    equ 0004h
CLC3GLS2_D3N_SIZE                        equ 0001h
CLC3GLS2_D3N_LENGTH                      equ 0001h
CLC3GLS2_D3N_MASK                        equ 0010h
CLC3GLS2_D3T_POSN                        equ 0005h
CLC3GLS2_D3T_POSITION                    equ 0005h
CLC3GLS2_D3T_SIZE                        equ 0001h
CLC3GLS2_D3T_LENGTH                      equ 0001h
CLC3GLS2_D3T_MASK                        equ 0020h
CLC3GLS2_D4N_POSN                        equ 0006h
CLC3GLS2_D4N_POSITION                    equ 0006h
CLC3GLS2_D4N_SIZE                        equ 0001h
CLC3GLS2_D4N_LENGTH                      equ 0001h
CLC3GLS2_D4N_MASK                        equ 0040h
CLC3GLS2_D4T_POSN                        equ 0007h
CLC3GLS2_D4T_POSITION                    equ 0007h
CLC3GLS2_D4T_SIZE                        equ 0001h
CLC3GLS2_D4T_LENGTH                      equ 0001h
CLC3GLS2_D4T_MASK                        equ 0080h

// Register: CLC3GLS3
#define CLC3GLS3 CLC3GLS3
CLC3GLS3                                 equ 0F2Dh
// bitfield definitions
CLC3GLS3_LC3G4D1N_POSN                   equ 0000h
CLC3GLS3_LC3G4D1N_POSITION               equ 0000h
CLC3GLS3_LC3G4D1N_SIZE                   equ 0001h
CLC3GLS3_LC3G4D1N_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D1N_MASK                   equ 0001h
CLC3GLS3_LC3G4D1T_POSN                   equ 0001h
CLC3GLS3_LC3G4D1T_POSITION               equ 0001h
CLC3GLS3_LC3G4D1T_SIZE                   equ 0001h
CLC3GLS3_LC3G4D1T_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D1T_MASK                   equ 0002h
CLC3GLS3_LC3G4D2N_POSN                   equ 0002h
CLC3GLS3_LC3G4D2N_POSITION               equ 0002h
CLC3GLS3_LC3G4D2N_SIZE                   equ 0001h
CLC3GLS3_LC3G4D2N_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D2N_MASK                   equ 0004h
CLC3GLS3_LC3G4D2T_POSN                   equ 0003h
CLC3GLS3_LC3G4D2T_POSITION               equ 0003h
CLC3GLS3_LC3G4D2T_SIZE                   equ 0001h
CLC3GLS3_LC3G4D2T_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D2T_MASK                   equ 0008h
CLC3GLS3_LC3G4D3N_POSN                   equ 0004h
CLC3GLS3_LC3G4D3N_POSITION               equ 0004h
CLC3GLS3_LC3G4D3N_SIZE                   equ 0001h
CLC3GLS3_LC3G4D3N_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D3N_MASK                   equ 0010h
CLC3GLS3_LC3G4D3T_POSN                   equ 0005h
CLC3GLS3_LC3G4D3T_POSITION               equ 0005h
CLC3GLS3_LC3G4D3T_SIZE                   equ 0001h
CLC3GLS3_LC3G4D3T_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D3T_MASK                   equ 0020h
CLC3GLS3_LC3G4D4N_POSN                   equ 0006h
CLC3GLS3_LC3G4D4N_POSITION               equ 0006h
CLC3GLS3_LC3G4D4N_SIZE                   equ 0001h
CLC3GLS3_LC3G4D4N_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D4N_MASK                   equ 0040h
CLC3GLS3_LC3G4D4T_POSN                   equ 0007h
CLC3GLS3_LC3G4D4T_POSITION               equ 0007h
CLC3GLS3_LC3G4D4T_SIZE                   equ 0001h
CLC3GLS3_LC3G4D4T_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D4T_MASK                   equ 0080h
CLC3GLS3_G4D1N_POSN                      equ 0000h
CLC3GLS3_G4D1N_POSITION                  equ 0000h
CLC3GLS3_G4D1N_SIZE                      equ 0001h
CLC3GLS3_G4D1N_LENGTH                    equ 0001h
CLC3GLS3_G4D1N_MASK                      equ 0001h
CLC3GLS3_G4D1T_POSN                      equ 0001h
CLC3GLS3_G4D1T_POSITION                  equ 0001h
CLC3GLS3_G4D1T_SIZE                      equ 0001h
CLC3GLS3_G4D1T_LENGTH                    equ 0001h
CLC3GLS3_G4D1T_MASK                      equ 0002h
CLC3GLS3_G4D2N_POSN                      equ 0002h
CLC3GLS3_G4D2N_POSITION                  equ 0002h
CLC3GLS3_G4D2N_SIZE                      equ 0001h
CLC3GLS3_G4D2N_LENGTH                    equ 0001h
CLC3GLS3_G4D2N_MASK                      equ 0004h
CLC3GLS3_G4D2T_POSN                      equ 0003h
CLC3GLS3_G4D2T_POSITION                  equ 0003h
CLC3GLS3_G4D2T_SIZE                      equ 0001h
CLC3GLS3_G4D2T_LENGTH                    equ 0001h
CLC3GLS3_G4D2T_MASK                      equ 0008h
CLC3GLS3_G4D3N_POSN                      equ 0004h
CLC3GLS3_G4D3N_POSITION                  equ 0004h
CLC3GLS3_G4D3N_SIZE                      equ 0001h
CLC3GLS3_G4D3N_LENGTH                    equ 0001h
CLC3GLS3_G4D3N_MASK                      equ 0010h
CLC3GLS3_G4D3T_POSN                      equ 0005h
CLC3GLS3_G4D3T_POSITION                  equ 0005h
CLC3GLS3_G4D3T_SIZE                      equ 0001h
CLC3GLS3_G4D3T_LENGTH                    equ 0001h
CLC3GLS3_G4D3T_MASK                      equ 0020h
CLC3GLS3_G4D4N_POSN                      equ 0006h
CLC3GLS3_G4D4N_POSITION                  equ 0006h
CLC3GLS3_G4D4N_SIZE                      equ 0001h
CLC3GLS3_G4D4N_LENGTH                    equ 0001h
CLC3GLS3_G4D4N_MASK                      equ 0040h
CLC3GLS3_G4D4T_POSN                      equ 0007h
CLC3GLS3_G4D4T_POSITION                  equ 0007h
CLC3GLS3_G4D4T_SIZE                      equ 0001h
CLC3GLS3_G4D4T_LENGTH                    equ 0001h
CLC3GLS3_G4D4T_MASK                      equ 0080h

// Register: CLC4CON
#define CLC4CON CLC4CON
CLC4CON                                  equ 0F2Eh
// bitfield definitions
CLC4CON_LC4MODE_POSN                     equ 0000h
CLC4CON_LC4MODE_POSITION                 equ 0000h
CLC4CON_LC4MODE_SIZE                     equ 0003h
CLC4CON_LC4MODE_LENGTH                   equ 0003h
CLC4CON_LC4MODE_MASK                     equ 0007h
CLC4CON_LC4INTN_POSN                     equ 0003h
CLC4CON_LC4INTN_POSITION                 equ 0003h
CLC4CON_LC4INTN_SIZE                     equ 0001h
CLC4CON_LC4INTN_LENGTH                   equ 0001h
CLC4CON_LC4INTN_MASK                     equ 0008h
CLC4CON_LC4INTP_POSN                     equ 0004h
CLC4CON_LC4INTP_POSITION                 equ 0004h
CLC4CON_LC4INTP_SIZE                     equ 0001h
CLC4CON_LC4INTP_LENGTH                   equ 0001h
CLC4CON_LC4INTP_MASK                     equ 0010h
CLC4CON_LC4OUT_POSN                      equ 0005h
CLC4CON_LC4OUT_POSITION                  equ 0005h
CLC4CON_LC4OUT_SIZE                      equ 0001h
CLC4CON_LC4OUT_LENGTH                    equ 0001h
CLC4CON_LC4OUT_MASK                      equ 0020h
CLC4CON_LC4EN_POSN                       equ 0007h
CLC4CON_LC4EN_POSITION                   equ 0007h
CLC4CON_LC4EN_SIZE                       equ 0001h
CLC4CON_LC4EN_LENGTH                     equ 0001h
CLC4CON_LC4EN_MASK                       equ 0080h
CLC4CON_LC4MODE0_POSN                    equ 0000h
CLC4CON_LC4MODE0_POSITION                equ 0000h
CLC4CON_LC4MODE0_SIZE                    equ 0001h
CLC4CON_LC4MODE0_LENGTH                  equ 0001h
CLC4CON_LC4MODE0_MASK                    equ 0001h
CLC4CON_LC4MODE1_POSN                    equ 0001h
CLC4CON_LC4MODE1_POSITION                equ 0001h
CLC4CON_LC4MODE1_SIZE                    equ 0001h
CLC4CON_LC4MODE1_LENGTH                  equ 0001h
CLC4CON_LC4MODE1_MASK                    equ 0002h
CLC4CON_LC4MODE2_POSN                    equ 0002h
CLC4CON_LC4MODE2_POSITION                equ 0002h
CLC4CON_LC4MODE2_SIZE                    equ 0001h
CLC4CON_LC4MODE2_LENGTH                  equ 0001h
CLC4CON_LC4MODE2_MASK                    equ 0004h
CLC4CON_MODE_POSN                        equ 0000h
CLC4CON_MODE_POSITION                    equ 0000h
CLC4CON_MODE_SIZE                        equ 0003h
CLC4CON_MODE_LENGTH                      equ 0003h
CLC4CON_MODE_MASK                        equ 0007h
CLC4CON_INTN_POSN                        equ 0003h
CLC4CON_INTN_POSITION                    equ 0003h
CLC4CON_INTN_SIZE                        equ 0001h
CLC4CON_INTN_LENGTH                      equ 0001h
CLC4CON_INTN_MASK                        equ 0008h
CLC4CON_INTP_POSN                        equ 0004h
CLC4CON_INTP_POSITION                    equ 0004h
CLC4CON_INTP_SIZE                        equ 0001h
CLC4CON_INTP_LENGTH                      equ 0001h
CLC4CON_INTP_MASK                        equ 0010h
CLC4CON_OUT_POSN                         equ 0005h
CLC4CON_OUT_POSITION                     equ 0005h
CLC4CON_OUT_SIZE                         equ 0001h
CLC4CON_OUT_LENGTH                       equ 0001h
CLC4CON_OUT_MASK                         equ 0020h
CLC4CON_EN_POSN                          equ 0007h
CLC4CON_EN_POSITION                      equ 0007h
CLC4CON_EN_SIZE                          equ 0001h
CLC4CON_EN_LENGTH                        equ 0001h
CLC4CON_EN_MASK                          equ 0080h
CLC4CON_MODE0_POSN                       equ 0000h
CLC4CON_MODE0_POSITION                   equ 0000h
CLC4CON_MODE0_SIZE                       equ 0001h
CLC4CON_MODE0_LENGTH                     equ 0001h
CLC4CON_MODE0_MASK                       equ 0001h
CLC4CON_MODE1_POSN                       equ 0001h
CLC4CON_MODE1_POSITION                   equ 0001h
CLC4CON_MODE1_SIZE                       equ 0001h
CLC4CON_MODE1_LENGTH                     equ 0001h
CLC4CON_MODE1_MASK                       equ 0002h
CLC4CON_MODE2_POSN                       equ 0002h
CLC4CON_MODE2_POSITION                   equ 0002h
CLC4CON_MODE2_SIZE                       equ 0001h
CLC4CON_MODE2_LENGTH                     equ 0001h
CLC4CON_MODE2_MASK                       equ 0004h

// Register: CLC4POL
#define CLC4POL CLC4POL
CLC4POL                                  equ 0F2Fh
// bitfield definitions
CLC4POL_LC4G1POL_POSN                    equ 0000h
CLC4POL_LC4G1POL_POSITION                equ 0000h
CLC4POL_LC4G1POL_SIZE                    equ 0001h
CLC4POL_LC4G1POL_LENGTH                  equ 0001h
CLC4POL_LC4G1POL_MASK                    equ 0001h
CLC4POL_LC4G2POL_POSN                    equ 0001h
CLC4POL_LC4G2POL_POSITION                equ 0001h
CLC4POL_LC4G2POL_SIZE                    equ 0001h
CLC4POL_LC4G2POL_LENGTH                  equ 0001h
CLC4POL_LC4G2POL_MASK                    equ 0002h
CLC4POL_LC4G3POL_POSN                    equ 0002h
CLC4POL_LC4G3POL_POSITION                equ 0002h
CLC4POL_LC4G3POL_SIZE                    equ 0001h
CLC4POL_LC4G3POL_LENGTH                  equ 0001h
CLC4POL_LC4G3POL_MASK                    equ 0004h
CLC4POL_LC4G4POL_POSN                    equ 0003h
CLC4POL_LC4G4POL_POSITION                equ 0003h
CLC4POL_LC4G4POL_SIZE                    equ 0001h
CLC4POL_LC4G4POL_LENGTH                  equ 0001h
CLC4POL_LC4G4POL_MASK                    equ 0008h
CLC4POL_LC4POL_POSN                      equ 0007h
CLC4POL_LC4POL_POSITION                  equ 0007h
CLC4POL_LC4POL_SIZE                      equ 0001h
CLC4POL_LC4POL_LENGTH                    equ 0001h
CLC4POL_LC4POL_MASK                      equ 0080h
CLC4POL_G1POL_POSN                       equ 0000h
CLC4POL_G1POL_POSITION                   equ 0000h
CLC4POL_G1POL_SIZE                       equ 0001h
CLC4POL_G1POL_LENGTH                     equ 0001h
CLC4POL_G1POL_MASK                       equ 0001h
CLC4POL_G2POL_POSN                       equ 0001h
CLC4POL_G2POL_POSITION                   equ 0001h
CLC4POL_G2POL_SIZE                       equ 0001h
CLC4POL_G2POL_LENGTH                     equ 0001h
CLC4POL_G2POL_MASK                       equ 0002h
CLC4POL_G3POL_POSN                       equ 0002h
CLC4POL_G3POL_POSITION                   equ 0002h
CLC4POL_G3POL_SIZE                       equ 0001h
CLC4POL_G3POL_LENGTH                     equ 0001h
CLC4POL_G3POL_MASK                       equ 0004h
CLC4POL_G4POL_POSN                       equ 0003h
CLC4POL_G4POL_POSITION                   equ 0003h
CLC4POL_G4POL_SIZE                       equ 0001h
CLC4POL_G4POL_LENGTH                     equ 0001h
CLC4POL_G4POL_MASK                       equ 0008h
CLC4POL_POL_POSN                         equ 0007h
CLC4POL_POL_POSITION                     equ 0007h
CLC4POL_POL_SIZE                         equ 0001h
CLC4POL_POL_LENGTH                       equ 0001h
CLC4POL_POL_MASK                         equ 0080h

// Register: CLC4SEL0
#define CLC4SEL0 CLC4SEL0
CLC4SEL0                                 equ 0F30h
// bitfield definitions
CLC4SEL0_LC4D1S0_POSN                    equ 0000h
CLC4SEL0_LC4D1S0_POSITION                equ 0000h
CLC4SEL0_LC4D1S0_SIZE                    equ 0001h
CLC4SEL0_LC4D1S0_LENGTH                  equ 0001h
CLC4SEL0_LC4D1S0_MASK                    equ 0001h
CLC4SEL0_LC4D1S1_POSN                    equ 0001h
CLC4SEL0_LC4D1S1_POSITION                equ 0001h
CLC4SEL0_LC4D1S1_SIZE                    equ 0001h
CLC4SEL0_LC4D1S1_LENGTH                  equ 0001h
CLC4SEL0_LC4D1S1_MASK                    equ 0002h
CLC4SEL0_LC4D1S2_POSN                    equ 0002h
CLC4SEL0_LC4D1S2_POSITION                equ 0002h
CLC4SEL0_LC4D1S2_SIZE                    equ 0001h
CLC4SEL0_LC4D1S2_LENGTH                  equ 0001h
CLC4SEL0_LC4D1S2_MASK                    equ 0004h
CLC4SEL0_LC4D1S3_POSN                    equ 0003h
CLC4SEL0_LC4D1S3_POSITION                equ 0003h
CLC4SEL0_LC4D1S3_SIZE                    equ 0001h
CLC4SEL0_LC4D1S3_LENGTH                  equ 0001h
CLC4SEL0_LC4D1S3_MASK                    equ 0008h
CLC4SEL0_LC4D1S4_POSN                    equ 0004h
CLC4SEL0_LC4D1S4_POSITION                equ 0004h
CLC4SEL0_LC4D1S4_SIZE                    equ 0001h
CLC4SEL0_LC4D1S4_LENGTH                  equ 0001h
CLC4SEL0_LC4D1S4_MASK                    equ 0010h
CLC4SEL0_LC4D1S5_POSN                    equ 0005h
CLC4SEL0_LC4D1S5_POSITION                equ 0005h
CLC4SEL0_LC4D1S5_SIZE                    equ 0001h
CLC4SEL0_LC4D1S5_LENGTH                  equ 0001h
CLC4SEL0_LC4D1S5_MASK                    equ 0020h
CLC4SEL0_LC4D1S_POSN                     equ 0000h
CLC4SEL0_LC4D1S_POSITION                 equ 0000h
CLC4SEL0_LC4D1S_SIZE                     equ 0008h
CLC4SEL0_LC4D1S_LENGTH                   equ 0008h
CLC4SEL0_LC4D1S_MASK                     equ 00FFh
CLC4SEL0_D1S_POSN                        equ 0000h
CLC4SEL0_D1S_POSITION                    equ 0000h
CLC4SEL0_D1S_SIZE                        equ 0008h
CLC4SEL0_D1S_LENGTH                      equ 0008h
CLC4SEL0_D1S_MASK                        equ 00FFh
CLC4SEL0_D1S0_POSN                       equ 0000h
CLC4SEL0_D1S0_POSITION                   equ 0000h
CLC4SEL0_D1S0_SIZE                       equ 0001h
CLC4SEL0_D1S0_LENGTH                     equ 0001h
CLC4SEL0_D1S0_MASK                       equ 0001h
CLC4SEL0_D1S1_POSN                       equ 0001h
CLC4SEL0_D1S1_POSITION                   equ 0001h
CLC4SEL0_D1S1_SIZE                       equ 0001h
CLC4SEL0_D1S1_LENGTH                     equ 0001h
CLC4SEL0_D1S1_MASK                       equ 0002h
CLC4SEL0_D1S2_POSN                       equ 0002h
CLC4SEL0_D1S2_POSITION                   equ 0002h
CLC4SEL0_D1S2_SIZE                       equ 0001h
CLC4SEL0_D1S2_LENGTH                     equ 0001h
CLC4SEL0_D1S2_MASK                       equ 0004h
CLC4SEL0_D1S3_POSN                       equ 0003h
CLC4SEL0_D1S3_POSITION                   equ 0003h
CLC4SEL0_D1S3_SIZE                       equ 0001h
CLC4SEL0_D1S3_LENGTH                     equ 0001h
CLC4SEL0_D1S3_MASK                       equ 0008h
CLC4SEL0_D1S4_POSN                       equ 0004h
CLC4SEL0_D1S4_POSITION                   equ 0004h
CLC4SEL0_D1S4_SIZE                       equ 0001h
CLC4SEL0_D1S4_LENGTH                     equ 0001h
CLC4SEL0_D1S4_MASK                       equ 0010h
CLC4SEL0_D1S5_POSN                       equ 0005h
CLC4SEL0_D1S5_POSITION                   equ 0005h
CLC4SEL0_D1S5_SIZE                       equ 0001h
CLC4SEL0_D1S5_LENGTH                     equ 0001h
CLC4SEL0_D1S5_MASK                       equ 0020h

// Register: CLC4SEL1
#define CLC4SEL1 CLC4SEL1
CLC4SEL1                                 equ 0F31h
// bitfield definitions
CLC4SEL1_LC4D2S0_POSN                    equ 0000h
CLC4SEL1_LC4D2S0_POSITION                equ 0000h
CLC4SEL1_LC4D2S0_SIZE                    equ 0001h
CLC4SEL1_LC4D2S0_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S0_MASK                    equ 0001h
CLC4SEL1_LC4D2S1_POSN                    equ 0001h
CLC4SEL1_LC4D2S1_POSITION                equ 0001h
CLC4SEL1_LC4D2S1_SIZE                    equ 0001h
CLC4SEL1_LC4D2S1_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S1_MASK                    equ 0002h
CLC4SEL1_LC4D2S2_POSN                    equ 0002h
CLC4SEL1_LC4D2S2_POSITION                equ 0002h
CLC4SEL1_LC4D2S2_SIZE                    equ 0001h
CLC4SEL1_LC4D2S2_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S2_MASK                    equ 0004h
CLC4SEL1_LC4D2S3_POSN                    equ 0003h
CLC4SEL1_LC4D2S3_POSITION                equ 0003h
CLC4SEL1_LC4D2S3_SIZE                    equ 0001h
CLC4SEL1_LC4D2S3_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S3_MASK                    equ 0008h
CLC4SEL1_LC4D2S4_POSN                    equ 0004h
CLC4SEL1_LC4D2S4_POSITION                equ 0004h
CLC4SEL1_LC4D2S4_SIZE                    equ 0001h
CLC4SEL1_LC4D2S4_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S4_MASK                    equ 0010h
CLC4SEL1_LC4D2S5_POSN                    equ 0005h
CLC4SEL1_LC4D2S5_POSITION                equ 0005h
CLC4SEL1_LC4D2S5_SIZE                    equ 0001h
CLC4SEL1_LC4D2S5_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S5_MASK                    equ 0020h
CLC4SEL1_LC4D2S_POSN                     equ 0000h
CLC4SEL1_LC4D2S_POSITION                 equ 0000h
CLC4SEL1_LC4D2S_SIZE                     equ 0008h
CLC4SEL1_LC4D2S_LENGTH                   equ 0008h
CLC4SEL1_LC4D2S_MASK                     equ 00FFh
CLC4SEL1_D2S_POSN                        equ 0000h
CLC4SEL1_D2S_POSITION                    equ 0000h
CLC4SEL1_D2S_SIZE                        equ 0008h
CLC4SEL1_D2S_LENGTH                      equ 0008h
CLC4SEL1_D2S_MASK                        equ 00FFh
CLC4SEL1_D2S0_POSN                       equ 0000h
CLC4SEL1_D2S0_POSITION                   equ 0000h
CLC4SEL1_D2S0_SIZE                       equ 0001h
CLC4SEL1_D2S0_LENGTH                     equ 0001h
CLC4SEL1_D2S0_MASK                       equ 0001h
CLC4SEL1_D2S1_POSN                       equ 0001h
CLC4SEL1_D2S1_POSITION                   equ 0001h
CLC4SEL1_D2S1_SIZE                       equ 0001h
CLC4SEL1_D2S1_LENGTH                     equ 0001h
CLC4SEL1_D2S1_MASK                       equ 0002h
CLC4SEL1_D2S2_POSN                       equ 0002h
CLC4SEL1_D2S2_POSITION                   equ 0002h
CLC4SEL1_D2S2_SIZE                       equ 0001h
CLC4SEL1_D2S2_LENGTH                     equ 0001h
CLC4SEL1_D2S2_MASK                       equ 0004h
CLC4SEL1_D2S3_POSN                       equ 0003h
CLC4SEL1_D2S3_POSITION                   equ 0003h
CLC4SEL1_D2S3_SIZE                       equ 0001h
CLC4SEL1_D2S3_LENGTH                     equ 0001h
CLC4SEL1_D2S3_MASK                       equ 0008h
CLC4SEL1_D2S4_POSN                       equ 0004h
CLC4SEL1_D2S4_POSITION                   equ 0004h
CLC4SEL1_D2S4_SIZE                       equ 0001h
CLC4SEL1_D2S4_LENGTH                     equ 0001h
CLC4SEL1_D2S4_MASK                       equ 0010h
CLC4SEL1_D2S5_POSN                       equ 0005h
CLC4SEL1_D2S5_POSITION                   equ 0005h
CLC4SEL1_D2S5_SIZE                       equ 0001h
CLC4SEL1_D2S5_LENGTH                     equ 0001h
CLC4SEL1_D2S5_MASK                       equ 0020h

