GopalSaraf/Practicals/PSDL/include/proc/pic16lf1615.inc
#define CCP2TSEL0                        BANKMASK(CCPTMRS), 2
#define CCP2TSEL1                        BANKMASK(CCPTMRS), 3
#define CCW5                             BANKMASK(AT1CC2L), 5
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CFGS                             BANKMASK(PMCON1), 6
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CHS4                             BANKMASK(ADCON0), 6
#define CKE                              BANKMASK(SSP1STAT), 6
#define CKP                              BANKMASK(SSP1CON1), 4
#define CKPPS0                           BANKMASK(CKPPS), 0
#define CKPPS1                           BANKMASK(CKPPS), 1
#define CKPPS2                           BANKMASK(CKPPS), 2
#define CKPPS3                           BANKMASK(CKPPS), 3
#define CKPPS4                           BANKMASK(CKPPS), 4
#define CLC1IE                           BANKMASK(PIE3), 0
#define CLC1IF                           BANKMASK(PIR3), 0
#define CLC2IE                           BANKMASK(PIE3), 1
#define CLC2IF                           BANKMASK(PIR3), 1
#define CLC3IE                           BANKMASK(PIE3), 2
#define CLC3IF                           BANKMASK(PIR3), 2
#define CLC4IE                           BANKMASK(PIE3), 3
#define CLC4IF                           BANKMASK(PIR3), 3
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4
#define CP1S0                            BANKMASK(AT1CSEL1), 0
#define CP1S1                            BANKMASK(AT1CSEL1), 1
#define CP1S2                            BANKMASK(AT1CSEL1), 2
#define CP2S0                            BANKMASK(AT1CSEL2), 0
#define CP2S1                            BANKMASK(AT1CSEL2), 1
#define CP2S2                            BANKMASK(AT1CSEL2), 2
#define CP3S0                            BANKMASK(AT1CSEL3), 0
#define CP3S1                            BANKMASK(AT1CSEL3), 1
#define CP3S2                            BANKMASK(AT1CSEL3), 2
#define CRCACC0                          BANKMASK(CRCACCL), 0
#define CRCACC1                          BANKMASK(CRCACCL), 1
#define CRCACC10                         BANKMASK(CRCACCH), 2
#define CRCACC11                         BANKMASK(CRCACCH), 3
#define CRCACC12                         BANKMASK(CRCACCH), 4
#define CRCACC13                         BANKMASK(CRCACCH), 5
#define CRCACC14                         BANKMASK(CRCACCH), 6
#define CRCACC15                         BANKMASK(CRCACCH), 7
#define CRCACC2                          BANKMASK(CRCACCL), 2
#define CRCACC3                          BANKMASK(CRCACCL), 3
#define CRCACC4                          BANKMASK(CRCACCL), 4
#define CRCACC5                          BANKMASK(CRCACCL), 5
#define CRCACC6                          BANKMASK(CRCACCL), 6
#define CRCACC7                          BANKMASK(CRCACCL), 7
#define CRCACC8                          BANKMASK(CRCACCH), 0
#define CRCACC9                          BANKMASK(CRCACCH), 1
#define CRCACCM                          BANKMASK(CRCCON0), 4
#define CRCBUSY                          BANKMASK(CRCCON0), 5
#define CRCDAT0                          BANKMASK(CRCDATL), 0
#define CRCDAT1                          BANKMASK(CRCDATL), 1
#define CRCDAT10                         BANKMASK(CRCDATH), 2
#define CRCDAT11                         BANKMASK(CRCDATH), 3
#define CRCDAT12                         BANKMASK(CRCDATH), 4
#define CRCDAT13                         BANKMASK(CRCDATH), 5
#define CRCDAT14                         BANKMASK(CRCDATH), 6
#define CRCDAT15                         BANKMASK(CRCDATH), 7
#define CRCDAT2                          BANKMASK(CRCDATL), 2
#define CRCDAT3                          BANKMASK(CRCDATL), 3
#define CRCDAT4                          BANKMASK(CRCDATL), 4
#define CRCDAT5                          BANKMASK(CRCDATL), 5
#define CRCDAT6                          BANKMASK(CRCDATL), 6
#define CRCDAT8                          BANKMASK(CRCDATH), 0
#define CRCDAT9                          BANKMASK(CRCDATH), 1
#define CRCDLEN0                         BANKMASK(CRCCON1), 4
#define CRCDLEN1                         BANKMASK(CRCCON1), 5
#define CRCDLEN2                         BANKMASK(CRCCON1), 6
#define CRCDLEN3                         BANKMASK(CRCCON1), 7
#define CRCEN                            BANKMASK(CRCCON0), 7
#define CRCFULL                          BANKMASK(CRCCON0), 0
#define CRCGO                            BANKMASK(CRCCON0), 6
#define CRCIE                            BANKMASK(PIE4), 6
#define CRCIF                            BANKMASK(PIR4), 6
#define CRCPLEN0                         BANKMASK(CRCCON1), 0
#define CRCPLEN1                         BANKMASK(CRCCON1), 1
#define CRCPLEN2                         BANKMASK(CRCCON1), 2
#define CRCPLEN3                         BANKMASK(CRCCON1), 3
#define CRCSHIFT0                        BANKMASK(CRCSHIFTL), 0
#define CRCSHIFT1                        BANKMASK(CRCSHIFTL), 1
#define CRCSHIFT10                       BANKMASK(CRCSHIFTH), 2
#define CRCSHIFT11                       BANKMASK(CRCSHIFTH), 3
#define CRCSHIFT12                       BANKMASK(CRCSHIFTH), 4
#define CRCSHIFT13                       BANKMASK(CRCSHIFTH), 5
#define CRCSHIFT14                       BANKMASK(CRCSHIFTH), 6
#define CRCSHIFT15                       BANKMASK(CRCSHIFTH), 7
#define CRCSHIFT2                        BANKMASK(CRCSHIFTL), 2
#define CRCSHIFT3                        BANKMASK(CRCSHIFTL), 3
#define CRCSHIFT4                        BANKMASK(CRCSHIFTL), 4
#define CRCSHIFT5                        BANKMASK(CRCSHIFTL), 5
#define CRCSHIFT6                        BANKMASK(CRCSHIFTL), 6
#define CRCSHIFT7                        BANKMASK(CRCSHIFTL), 7
#define CRCSHIFT8                        BANKMASK(CRCSHIFTH), 0
#define CRCSHIFT9                        BANKMASK(CRCSHIFTH), 1
#define CRCSHIFTM                        BANKMASK(CRCCON0), 1
#define CRCXOR1                          BANKMASK(CRCXORL), 1
#define CRCXOR10                         BANKMASK(CRCXORH), 2
#define CRCXOR11                         BANKMASK(CRCXORH), 3
#define CRCXOR12                         BANKMASK(CRCXORH), 4
#define CRCXOR13                         BANKMASK(CRCXORH), 5
#define CRCXOR14                         BANKMASK(CRCXORH), 6
#define CRCXOR15                         BANKMASK(CRCXORH), 7
#define CRCXOR2                          BANKMASK(CRCXORL), 2
#define CRCXOR3                          BANKMASK(CRCXORL), 3
#define CRCXOR4                          BANKMASK(CRCXORL), 4
#define CRCXOR5                          BANKMASK(CRCXORL), 5
#define CRCXOR6                          BANKMASK(CRCXORL), 6
#define CRCXOR7                          BANKMASK(CRCXORL), 7
#define CRCXOR8                          BANKMASK(CRCXORH), 0
#define CRCXOR9                          BANKMASK(CRCXORH), 1
#define CRDCDAT7                         BANKMASK(CRCDATL), 7
#define CREN                             BANKMASK(RC1STA), 4
#define CSRC                             BANKMASK(TX1STA), 7
#define CWG1C1AS                         BANKMASK(CWG1AS1), 1
#define CWG1C2AS                         BANKMASK(CWG1AS1), 2
#define CWG1CS                           BANKMASK(CWG1CLKCON), 0
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5
#define CWG1EN                           BANKMASK(CWG1CON0), 7
#define CWG1IN                           BANKMASK(CWG1CON1), 5
#define CWG1INAS                         BANKMASK(CWG1AS1), 0
#define CWG1IS0                          BANKMASK(CWG1ISM), 0
#define CWG1IS1                          BANKMASK(CWG1ISM), 1
#define CWG1IS2                          BANKMASK(CWG1ISM), 2
#define CWG1IS3                          BANKMASK(CWG1ISM), 3
#define CWG1LD                           BANKMASK(CWG1CON0), 6
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2
#define CWG1OVRA                         BANKMASK(CWG1OCON0), 4
#define CWG1OVRB                         BANKMASK(CWG1OCON0), 5
#define CWG1OVRC                         BANKMASK(CWG1OCON0), 6
#define CWG1OVRD                         BANKMASK(CWG1OCON0), 7
#define CWG1POLA                         BANKMASK(CWG1CON1), 0
#define CWG1POLB                         BANKMASK(CWG1CON1), 1
#define CWG1POLC                         BANKMASK(CWG1CON1), 2
#define CWG1POLD                         BANKMASK(CWG1CON1), 3
#define CWG1REN                          BANKMASK(CWG1AS0), 6
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7
#define CWG1STRA                         BANKMASK(CWG1OCON0), 0
#define CWG1STRB                         BANKMASK(CWG1OCON0), 1
#define CWG1STRC                         BANKMASK(CWG1OCON0), 2
#define CWG1STRD                         BANKMASK(CWG1OCON0), 3
#define CWG1TMR2AS                       BANKMASK(CWG1AS1), 4
#define CWG1TMR4AS                       BANKMASK(CWG1AS1), 5
#define CWG1TMR6AS                       BANKMASK(CWG1AS1), 6
#define CWGIE                            BANKMASK(PIE3), 5
#define CWGIF                            BANKMASK(PIR3), 5
#define CWGINPPS0                        BANKMASK(CWGINPPS), 0
#define CWGINPPS1                        BANKMASK(CWGINPPS), 1
#define CWGINPPS2                        BANKMASK(CWGINPPS), 2
#define CWGINPPS3                        BANKMASK(CWGINPPS), 3
#define CWGINPPS4                        BANKMASK(CWGINPPS), 4
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define D1PSS0                           BANKMASK(DAC1CON0), 2
#define D1PSS1                           BANKMASK(DAC1CON0), 3
#define DAC1EN                           BANKMASK(DAC1CON0), 7
#define DAC1OE                           BANKMASK(DAC1CON0), 5
#define DAC1R0                           BANKMASK(DAC1CON1), 0
#define DAC1R1                           BANKMASK(DAC1CON1), 1
#define DAC1R2                           BANKMASK(DAC1CON1), 2
#define DAC1R3                           BANKMASK(DAC1CON1), 3
#define DAC1R4                           BANKMASK(DAC1CON1), 4
#define DAC1R5                           BANKMASK(DAC1CON1), 5
#define DAC1R6                           BANKMASK(DAC1CON1), 6
#define DAC1R7                           BANKMASK(DAC1CON1), 7
#define DAT0                             BANKMASK(CRCDATL), 0
#define DAT1                             BANKMASK(CRCDATL), 1
#define DAT10                            BANKMASK(CRCDATH), 2
#define DAT11                            BANKMASK(CRCDATH), 3
#define DAT12                            BANKMASK(CRCDATH), 4
#define DAT13                            BANKMASK(CRCDATH), 5
#define DAT14                            BANKMASK(CRCDATH), 6
#define DAT15                            BANKMASK(CRCDATH), 7
#define DAT2                             BANKMASK(CRCDATL), 2
#define DAT3                             BANKMASK(CRCDATL), 3
#define DAT4                             BANKMASK(CRCDATL), 4
#define DAT5                             BANKMASK(CRCDATL), 5
#define DAT6                             BANKMASK(CRCDATL), 6
#define DAT7                             BANKMASK(CRCDATL), 7
#define DAT8                             BANKMASK(CRCDATH), 0
#define DAT9                             BANKMASK(CRCDATH), 1
#define DBF0                             BANKMASK(CWG1DBF), 0
#define DBF1                             BANKMASK(CWG1DBF), 1
#define DBF2                             BANKMASK(CWG1DBF), 2
#define DBF3                             BANKMASK(CWG1DBF), 3
#define DBF4                             BANKMASK(CWG1DBF), 4
#define DBF5                             BANKMASK(CWG1DBF), 5
#define DBR0                             BANKMASK(CWG1DBR), 0
#define DBR1                             BANKMASK(CWG1DBR), 1
#define DBR2                             BANKMASK(CWG1DBR), 2
#define DBR3                             BANKMASK(CWG1DBR), 3
#define DBR4                             BANKMASK(CWG1DBR), 4
#define DBR5                             BANKMASK(CWG1DBR), 5
#define DC                               BANKMASK(STATUS), 1
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define DHEN                             BANKMASK(SSP1CON3), 0
#define DLEN0                            BANKMASK(CRCCON1), 4
#define DLEN1                            BANKMASK(CRCCON1), 5
#define DLEN2                            BANKMASK(CRCCON1), 6
#define DLEN3                            BANKMASK(CRCCON1), 7
#define D_nA                             BANKMASK(SSP1STAT), 5
#define ERR0                             BANKMASK(AT1ERRL), 0
#define ERR1                             BANKMASK(AT1ERRL), 1
#define ERR10                            BANKMASK(AT1ERRH), 2
#define ERR11                            BANKMASK(AT1ERRH), 3
#define ERR12                            BANKMASK(AT1ERRH), 4
#define ERR13                            BANKMASK(AT1ERRH), 5
#define ERR14                            BANKMASK(AT1ERRH), 6
#define ERR15                            BANKMASK(AT1ERRH), 7
#define ERR2                             BANKMASK(AT1ERRL), 2
#define ERR3                             BANKMASK(AT1ERRL), 3
#define ERR4                             BANKMASK(AT1ERRL), 4
#define ERR5                             BANKMASK(AT1ERRL), 5
#define ERR6                             BANKMASK(AT1ERRL), 6
#define ERR7                             BANKMASK(AT1ERRL), 7
#define ERR8                             BANKMASK(AT1ERRH), 0
#define ERR9                             BANKMASK(AT1ERRH), 1
#define ERRH0                            BANKMASK(AT1ERRH), 0
#define ERRH1                            BANKMASK(AT1ERRH), 1
#define ERRH2                            BANKMASK(AT1ERRH), 2
#define ERRH3                            BANKMASK(AT1ERRH), 3
#define ERRH4                            BANKMASK(AT1ERRH), 4
#define ERRH5                            BANKMASK(AT1ERRH), 5
#define ERRH6                            BANKMASK(AT1ERRH), 6
#define ERRH7                            BANKMASK(AT1ERRH), 7
#define ERRL0                            BANKMASK(AT1ERRL), 0
#define ERRL1                            BANKMASK(AT1ERRL), 1
#define ERRL2                            BANKMASK(AT1ERRL), 2
#define ERRL3                            BANKMASK(AT1ERRL), 3
#define ERRL4                            BANKMASK(AT1ERRL), 4
#define ERRL5                            BANKMASK(AT1ERRL), 5
#define ERRL6                            BANKMASK(AT1ERRL), 6
#define ERRL7                            BANKMASK(AT1ERRL), 7
#define FERR                             BANKMASK(RC1STA), 2
#define FREE                             BANKMASK(PMCON1), 4
#define FULL                             BANKMASK(CRCCON0), 0
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1EN                             BANKMASK(CWG1CON0), 7
#define GCEN                             BANKMASK(SSP1CON2), 7
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define HADR0                            BANKMASK(SCANHADRL), 0
#define HADR1                            BANKMASK(SCANHADRL), 1
#define HADR10                           BANKMASK(SCANHADRH), 2
#define HADR11                           BANKMASK(SCANHADRH), 3
#define HADR12                           BANKMASK(SCANHADRH), 4
#define HADR13                           BANKMASK(SCANHADRH), 5
#define HADR14                           BANKMASK(SCANHADRH), 6
#define HADR15                           BANKMASK(SCANHADRH), 7
#define HADR3                            BANKMASK(SCANHADRL), 3
#define HADR4                            BANKMASK(SCANHADRL), 4
#define HADR5                            BANKMASK(SCANHADRL), 5
#define HADR6                            BANKMASK(SCANHADRL), 6
#define HADR7                            BANKMASK(SCANHADRL), 7
#define HADR8                            BANKMASK(SCANHADRH), 0
#define HADR9                            BANKMASK(SCANHADRH), 1
#define HARD2                            BANKMASK(SCANHADRL), 2
#define HFIOFL                           BANKMASK(OSCSTAT), 3
#define HFIOFR                           BANKMASK(OSCSTAT), 4
#define HFIOFS                           BANKMASK(OSCSTAT), 0
#define HIDC4                            BANKMASK(HIDRVC), 4
#define HIDC5                            BANKMASK(HIDRVC), 5
#define IN                               BANKMASK(CWG1CON1), 5
#define IN0                              BANKMASK(PID1INL), 0
#define IN1                              BANKMASK(PID1INL), 1
#define IN10                             BANKMASK(PID1INH), 2
#define IN11                             BANKMASK(PID1INH), 3
#define IN12                             BANKMASK(PID1INH), 4
#define IN13                             BANKMASK(PID1INH), 5
#define IN14                             BANKMASK(PID1INH), 6
#define IN15                             BANKMASK(PID1INH), 7
#define IN2                              BANKMASK(PID1INL), 2
#define IN3                              BANKMASK(PID1INL), 3
#define IN4                              BANKMASK(PID1INL), 4
#define IN5                              BANKMASK(PID1INL), 5
#define IN6                              BANKMASK(PID1INL), 6
#define IN7                              BANKMASK(PID1INL), 7
#define IN8                              BANKMASK(PID1INH), 0
#define IN9                              BANKMASK(PID1INH), 1
#define INAS                             BANKMASK(CWG1AS1), 0
#define INLVLA0                          BANKMASK(INLVLA), 0
#define INLVLA1                          BANKMASK(INLVLA), 1
#define INLVLA2                          BANKMASK(INLVLA), 2
#define INLVLA3                          BANKMASK(INLVLA), 3
#define INLVLA4                          BANKMASK(INLVLA), 4
#define INLVLA5                          BANKMASK(INLVLA), 5
#define INLVLC0                          BANKMASK(INLVLC), 0
#define INLVLC1                          BANKMASK(INLVLC), 1
#define INLVLC2                          BANKMASK(INLVLC), 2
#define INLVLC3                          BANKMASK(INLVLC), 3
#define INLVLC4                          BANKMASK(INLVLC), 4
#define INLVLC5                          BANKMASK(INLVLC), 5
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define INTM                             BANKMASK(SCANCON0), 3
#define INTPPS0                          BANKMASK(INTPPS), 0
#define INTPPS1                          BANKMASK(INTPPS), 1
#define INTPPS2                          BANKMASK(INTPPS), 2
#define INTPPS3                          BANKMASK(INTPPS), 3
#define INTPPS4                          BANKMASK(INTPPS), 4
#define INVALID                          BANKMASK(SCANCON0), 4
#define IOCAF0                           BANKMASK(IOCAF), 0
#define IOCAF1                           BANKMASK(IOCAF), 1
#define IOCAF2                           BANKMASK(IOCAF), 2
#define IOCAF3                           BANKMASK(IOCAF), 3
#define IOCAF4                           BANKMASK(IOCAF), 4
#define IOCAF5                           BANKMASK(IOCAF), 5
#define IOCAN0                           BANKMASK(IOCAN), 0
#define IOCAN1                           BANKMASK(IOCAN), 1
#define IOCAN2                           BANKMASK(IOCAN), 2
#define IOCAN3                           BANKMASK(IOCAN), 3
#define IOCAN4                           BANKMASK(IOCAN), 4
#define IOCAN5                           BANKMASK(IOCAN), 5
#define IOCAP0                           BANKMASK(IOCAP), 0
#define IOCAP1                           BANKMASK(IOCAP), 1
#define IOCAP2                           BANKMASK(IOCAP), 2
#define IOCAP3                           BANKMASK(IOCAP), 3
#define IOCAP4                           BANKMASK(IOCAP), 4
#define IOCAP5                           BANKMASK(IOCAP), 5
#define IOCCF0                           BANKMASK(IOCCF), 0
#define IOCCF1                           BANKMASK(IOCCF), 1
#define IOCCF2                           BANKMASK(IOCCF), 2
#define IOCCF3                           BANKMASK(IOCCF), 3
#define IOCCF4                           BANKMASK(IOCCF), 4
#define IOCCF5                           BANKMASK(IOCCF), 5
#define IOCCF6                           BANKMASK(IOCCF), 6
#define IOCCF7                           BANKMASK(IOCCF), 7
#define IOCCN0                           BANKMASK(IOCCN), 0
#define IOCCN1                           BANKMASK(IOCCN), 1
#define IOCCN2                           BANKMASK(IOCCN), 2
#define IOCCN3                           BANKMASK(IOCCN), 3
#define IOCCN4                           BANKMASK(IOCCN), 4
#define IOCCN5                           BANKMASK(IOCCN), 5
#define IOCCN6                           BANKMASK(IOCCN), 6
#define IOCCN7                           BANKMASK(IOCCN), 7
#define IOCCP0                           BANKMASK(IOCCP), 0
#define IOCCP1                           BANKMASK(IOCCP), 1
#define IOCCP2                           BANKMASK(IOCCP), 2
#define IOCCP3                           BANKMASK(IOCCP), 3
#define IOCCP4                           BANKMASK(IOCCP), 4
#define IOCCP5                           BANKMASK(IOCCP), 5
#define IOCCP6                           BANKMASK(IOCCP), 6
#define IOCCP7                           BANKMASK(IOCCP), 7
#define IOCIE                            BANKMASK(INTCON), 3
#define IOCIF                            BANKMASK(INTCON), 0
